# encoding: UTF-8

#########################################################################
###@system 新一代交易所系统
###@company 上海期货信息技术有限公司
###@file ThostFtdcUserApiDataType.h
###@brief 定义了客户端接口使用的业务数据类型
###@history 
###20060106	赵鸿昊		创建该文件
#########################################################################

cdef extern from "ThostFtdcUserApiDataType.h":
    cdef enum THOST_TE_RESUME_TYPE:
        THOST_TERT_RESTART = 0
        THOST_TERT_RESUME = 1
        THOST_TERT_QUICK = 2
    
    #########################################################################
    ###TFtdcTraderIDType是一个交易所交易员代码类型
    #########################################################################
    ctypedef char TThostFtdcTraderIDType[21]

    #########################################################################
    ###TFtdcInvestorIDType是一个投资者代码类型
    #########################################################################
    ctypedef char TThostFtdcInvestorIDType[13]

    #########################################################################
    ###TFtdcBrokerIDType是一个经纪公司代码类型
    #########################################################################
    ctypedef char TThostFtdcBrokerIDType[11]

    #########################################################################
    ###TFtdcBrokerAbbrType是一个经纪公司简称类型
    #########################################################################
    ctypedef char TThostFtdcBrokerAbbrType[9]

    #########################################################################
    ###TFtdcBrokerNameType是一个经纪公司名称类型
    #########################################################################
    ctypedef char TThostFtdcBrokerNameType[81]

    #########################################################################
    ###TFtdcExchangeInstIDType是一个合约在交易所的代码类型
    #########################################################################
    ctypedef char TThostFtdcExchangeInstIDType[31]

    #########################################################################
    ###TFtdcOrderRefType是一个报单引用类型
    #########################################################################
    ctypedef char TThostFtdcOrderRefType[13]

    #########################################################################
    ###TFtdcParticipantIDType是一个会员代码类型
    #########################################################################
    ctypedef char TThostFtdcParticipantIDType[11]

    #########################################################################
    ###TFtdcUserIDType是一个用户代码类型
    #########################################################################
    ctypedef char TThostFtdcUserIDType[16]

    #########################################################################
    ###TFtdcPasswordType是一个密码类型
    #########################################################################
    ctypedef char TThostFtdcPasswordType[41]

    #########################################################################
    ###TFtdcClientIDType是一个交易编码类型
    #########################################################################
    ctypedef char TThostFtdcClientIDType[11]

    #########################################################################
    ###TFtdcInstrumentIDType是一个合约代码类型
    #########################################################################
    ctypedef char TThostFtdcInstrumentIDType[31]

    #########################################################################
    ###TFtdcMarketIDType是一个市场代码类型
    #########################################################################
    ctypedef char TThostFtdcMarketIDType[31]

    #########################################################################
    ###TFtdcProductNameType是一个产品名称类型
    #########################################################################
    ctypedef char TThostFtdcProductNameType[21]

    #########################################################################
    ###TFtdcExchangeIDType是一个交易所代码类型
    #########################################################################
    ctypedef char TThostFtdcExchangeIDType[9]

    #########################################################################
    ###TFtdcExchangeNameType是一个交易所名称类型
    #########################################################################
    ctypedef char TThostFtdcExchangeNameType[61]

    #########################################################################
    ###TFtdcExchangeAbbrType是一个交易所简称类型
    #########################################################################
    ctypedef char TThostFtdcExchangeAbbrType[9]

    #########################################################################
    ###TFtdcExchangeFlagType是一个交易所标志类型
    #########################################################################
    ctypedef char TThostFtdcExchangeFlagType[2]

    #########################################################################
    ###TFtdcMacAddressType是一个Mac地址类型
    #########################################################################
    ctypedef char TThostFtdcMacAddressType[21]

    #########################################################################
    ###TFtdcSystemIDType是一个系统编号类型
    #########################################################################
    ctypedef char TThostFtdcSystemIDType[21]

    #########################################################################
    ###TFtdcExchangePropertyType是一个交易所属性类型
    #########################################################################
    ctypedef char TThostFtdcExchangePropertyType

    #########################################################################
    ###TFtdcDateType是一个日期类型
    #########################################################################
    ctypedef char TThostFtdcDateType[9]

    #########################################################################
    ###TFtdcTimeType是一个时间类型
    #########################################################################
    ctypedef char TThostFtdcTimeType[9]

    #########################################################################
    ###TFtdcLongTimeType是一个长时间类型
    #########################################################################
    ctypedef char TThostFtdcLongTimeType[13]

    #########################################################################
    ###TFtdcInstrumentNameType是一个合约名称类型
    #########################################################################
    ctypedef char TThostFtdcInstrumentNameType[21]

    #########################################################################
    ###TFtdcSettlementGroupIDType是一个结算组代码类型
    #########################################################################
    ctypedef char TThostFtdcSettlementGroupIDType[9]

    #########################################################################
    ###TFtdcOrderSysIDType是一个报单编号类型
    #########################################################################
    ctypedef char TThostFtdcOrderSysIDType[21]

    #########################################################################
    ###TFtdcTradeIDType是一个成交编号类型
    #########################################################################
    ctypedef char TThostFtdcTradeIDType[21]

    #########################################################################
    ###TFtdcCommandTypeType是一个DB命令类型类型
    #########################################################################
    ctypedef char TThostFtdcCommandTypeType[65]

    #########################################################################
    ###TFtdcIPAddressType是一个IP地址类型
    #########################################################################
    ctypedef char TThostFtdcIPAddressType[16]

    #########################################################################
    ###TFtdcIPPortType是一个IP端口类型
    #########################################################################
    ctypedef int TThostFtdcIPPortType

    #########################################################################
    ###TFtdcProductInfoType是一个产品信息类型
    #########################################################################
    ctypedef char TThostFtdcProductInfoType[11]

    #########################################################################
    ###TFtdcProtocolInfoType是一个协议信息类型
    #########################################################################
    ctypedef char TThostFtdcProtocolInfoType[11]

    #########################################################################
    ###TFtdcBusinessUnitType是一个业务单元类型
    #########################################################################
    ctypedef char TThostFtdcBusinessUnitType[21]

    #########################################################################
    ###TFtdcDepositSeqNoType是一个出入金流水号类型
    #########################################################################
    ctypedef char TThostFtdcDepositSeqNoType[15]

    #########################################################################
    ###TFtdcIdentifiedCardNoType是一个证件号码类型
    #########################################################################
    ctypedef char TThostFtdcIdentifiedCardNoType[51]

    #########################################################################
    ###TFtdcIdCardTypeType是一个证件类型类型
    #########################################################################
    ctypedef char TThostFtdcIdCardTypeType

    #########################################################################
    ###TFtdcOrderLocalIDType是一个本地报单编号类型
    #########################################################################
    ctypedef char TThostFtdcOrderLocalIDType[13]

    #########################################################################
    ###TFtdcUserNameType是一个用户名称类型
    #########################################################################
    ctypedef char TThostFtdcUserNameType[81]

    #########################################################################
    ###TFtdcPartyNameType是一个参与人名称类型
    #########################################################################
    ctypedef char TThostFtdcPartyNameType[81]

    #########################################################################
    ###TFtdcErrorMsgType是一个错误信息类型
    #########################################################################
    ctypedef char TThostFtdcErrorMsgType[81]

    #########################################################################
    ###TFtdcFieldNameType是一个字段名类型
    #########################################################################
    ctypedef char TThostFtdcFieldNameType[2049]

    #########################################################################
    ###TFtdcFieldContentType是一个字段内容类型
    #########################################################################
    ctypedef char TThostFtdcFieldContentType[2049]

    #########################################################################
    ###TFtdcSystemNameType是一个系统名称类型
    #########################################################################
    ctypedef char TThostFtdcSystemNameType[41]

    #########################################################################
    ###TFtdcContentType是一个消息正文类型
    #########################################################################
    ctypedef char TThostFtdcContentType[501]

    #########################################################################
    ###TFtdcInvestorRangeType是一个投资者范围类型
    #########################################################################
    ctypedef char TThostFtdcInvestorRangeType

    #########################################################################
    ###TFtdcDepartmentRangeType是一个投资者范围类型
    #########################################################################
    ctypedef char TThostFtdcDepartmentRangeType

    #########################################################################
    ###TFtdcDataSyncStatusType是一个数据同步状态类型
    #########################################################################
    ctypedef char TThostFtdcDataSyncStatusType

    #########################################################################
    ###TFtdcBrokerDataSyncStatusType是一个经纪公司数据同步状态类型
    #########################################################################
    ctypedef char TThostFtdcBrokerDataSyncStatusType

    #########################################################################
    ###TFtdcExchangeConnectStatusType是一个交易所连接状态类型
    #########################################################################
    ctypedef char TThostFtdcExchangeConnectStatusType

    #########################################################################
    ###TFtdcTraderConnectStatusType是一个交易所交易员连接状态类型
    #########################################################################
    ctypedef char TThostFtdcTraderConnectStatusType

    #########################################################################
    ###TFtdcFunctionCodeType是一个功能代码类型
    #########################################################################
    ctypedef char TThostFtdcFunctionCodeType

    #########################################################################
    ###TFtdcBrokerFunctionCodeType是一个经纪公司功能代码类型
    #########################################################################
    ctypedef char TThostFtdcBrokerFunctionCodeType

    #########################################################################
    ###TFtdcOrderActionStatusType是一个报单操作状态类型
    #########################################################################
    ctypedef char TThostFtdcOrderActionStatusType

    #########################################################################
    ###TFtdcOrderStatusType是一个报单状态类型
    #########################################################################
    ctypedef char TThostFtdcOrderStatusType

    #########################################################################
    ###TFtdcOrderSubmitStatusType是一个报单提交状态类型
    #########################################################################
    ctypedef char TThostFtdcOrderSubmitStatusType

    #########################################################################
    ###TFtdcPositionDateType是一个持仓日期类型
    #########################################################################
    ctypedef char TThostFtdcPositionDateType

    #########################################################################
    ###TFtdcPositionDateTypeType是一个持仓日期类型类型
    #########################################################################
    ctypedef char TThostFtdcPositionDateTypeType

    #########################################################################
    ###TFtdcTradingRoleType是一个交易角色类型
    #########################################################################
    ctypedef char TThostFtdcTradingRoleType

    #########################################################################
    ###TFtdcProductClassType是一个产品类型类型
    #########################################################################
    ctypedef char TThostFtdcProductClassType

    #########################################################################
    ###TFtdcInstLifePhaseType是一个合约生命周期状态类型
    #########################################################################
    ctypedef char TThostFtdcInstLifePhaseType

    #########################################################################
    ###TFtdcDirectionType是一个买卖方向类型
    #########################################################################
    ctypedef char TThostFtdcDirectionType

    #########################################################################
    ###TFtdcPositionTypeType是一个持仓类型类型
    #########################################################################
    ctypedef char TThostFtdcPositionTypeType

    #########################################################################
    ###TFtdcPosiDirectionType是一个持仓多空方向类型
    #########################################################################
    ctypedef char TThostFtdcPosiDirectionType

    #########################################################################
    ###TFtdcSysSettlementStatusType是一个系统结算状态类型
    #########################################################################
    ctypedef char TThostFtdcSysSettlementStatusType

    #########################################################################
    ###TFtdcRatioAttrType是一个费率属性类型
    #########################################################################
    ctypedef char TThostFtdcRatioAttrType

    #########################################################################
    ###TFtdcHedgeFlagType是一个投机套保标志类型
    #########################################################################
    ctypedef char TThostFtdcHedgeFlagType

    #########################################################################
    ###TFtdcBillHedgeFlagType是一个投机套保标志类型
    #########################################################################
    ctypedef char TThostFtdcBillHedgeFlagType

    #########################################################################
    ###TFtdcClientIDTypeType是一个交易编码类型类型
    #########################################################################
    ctypedef char TThostFtdcClientIDTypeType

    #########################################################################
    ###TFtdcOrderPriceTypeType是一个报单价格条件类型
    #########################################################################
    ctypedef char TThostFtdcOrderPriceTypeType

    #########################################################################
    ###TFtdcOffsetFlagType是一个开平标志类型
    #########################################################################
    ctypedef char TThostFtdcOffsetFlagType

    #########################################################################
    ###TFtdcForceCloseReasonType是一个强平原因类型
    #########################################################################
    ctypedef char TThostFtdcForceCloseReasonType

    #########################################################################
    ###TFtdcOrderTypeType是一个报单类型类型
    #########################################################################
    ctypedef char TThostFtdcOrderTypeType

    #########################################################################
    ###TFtdcTimeConditionType是一个有效期类型类型
    #########################################################################
    ctypedef char TThostFtdcTimeConditionType

    #########################################################################
    ###TFtdcVolumeConditionType是一个成交量类型类型
    #########################################################################
    ctypedef char TThostFtdcVolumeConditionType

    #########################################################################
    ###TFtdcContingentConditionType是一个触发条件类型
    #########################################################################
    ctypedef char TThostFtdcContingentConditionType

    #########################################################################
    ###TFtdcActionFlagType是一个操作标志类型
    #########################################################################
    ctypedef char TThostFtdcActionFlagType

    #########################################################################
    ###TFtdcTradingRightType是一个交易权限类型
    #########################################################################
    ctypedef char TThostFtdcTradingRightType

    #########################################################################
    ###TFtdcOrderSourceType是一个报单来源类型
    #########################################################################
    ctypedef char TThostFtdcOrderSourceType

    #########################################################################
    ###TFtdcTradeTypeType是一个成交类型类型
    #########################################################################
    ctypedef char TThostFtdcTradeTypeType

    #########################################################################
    ###TFtdcPriceSourceType是一个成交价来源类型
    #########################################################################
    ctypedef char TThostFtdcPriceSourceType

    #########################################################################
    ###TFtdcInstrumentStatusType是一个合约交易状态类型
    #########################################################################
    ctypedef char TThostFtdcInstrumentStatusType

    #########################################################################
    ###TFtdcInstStatusEnterReasonType是一个品种进入交易状态原因类型
    #########################################################################
    ctypedef char TThostFtdcInstStatusEnterReasonType

    #########################################################################
    ###TFtdcOrderActionRefType是一个报单操作引用类型
    #########################################################################
    ctypedef int TThostFtdcOrderActionRefType

    #########################################################################
    ###TFtdcInstallCountType是一个安装数量类型
    #########################################################################
    ctypedef int TThostFtdcInstallCountType

    #########################################################################
    ###TFtdcInstallIDType是一个安装编号类型
    #########################################################################
    ctypedef int TThostFtdcInstallIDType

    #########################################################################
    ###TFtdcErrorIDType是一个错误代码类型
    #########################################################################
    ctypedef int TThostFtdcErrorIDType

    #########################################################################
    ###TFtdcSettlementIDType是一个结算编号类型
    #########################################################################
    ctypedef int TThostFtdcSettlementIDType

    #########################################################################
    ###TFtdcVolumeType是一个数量类型
    #########################################################################
    ctypedef int TThostFtdcVolumeType

    #########################################################################
    ###TFtdcFrontIDType是一个前置编号类型
    #########################################################################
    ctypedef int TThostFtdcFrontIDType

    #########################################################################
    ###TFtdcSessionIDType是一个会话编号类型
    #########################################################################
    ctypedef int TThostFtdcSessionIDType

    #########################################################################
    ###TFtdcSequenceNoType是一个序号类型
    #########################################################################
    ctypedef int TThostFtdcSequenceNoType

    #########################################################################
    ###TFtdcCommandNoType是一个DB命令序号类型
    #########################################################################
    ctypedef int TThostFtdcCommandNoType

    #########################################################################
    ###TFtdcMillisecType是一个时间（毫秒）类型
    #########################################################################
    ctypedef int TThostFtdcMillisecType

    #########################################################################
    ###TFtdcVolumeMultipleType是一个合约数量乘数类型
    #########################################################################
    ctypedef int TThostFtdcVolumeMultipleType

    #########################################################################
    ###TFtdcTradingSegmentSNType是一个交易阶段编号类型
    #########################################################################
    ctypedef int TThostFtdcTradingSegmentSNType

    #########################################################################
    ###TFtdcRequestIDType是一个请求编号类型
    #########################################################################
    ctypedef int TThostFtdcRequestIDType

    #########################################################################
    ###TFtdcYearType是一个年份类型
    #########################################################################
    ctypedef int TThostFtdcYearType

    #########################################################################
    ###TFtdcMonthType是一个月份类型
    #########################################################################
    ctypedef int TThostFtdcMonthType

    #########################################################################
    ###TFtdcBoolType是一个布尔型类型
    #########################################################################
    ctypedef int TThostFtdcBoolType

    #########################################################################
    ###TFtdcPriceType是一个价格类型
    #########################################################################
    ctypedef double TThostFtdcPriceType

    #########################################################################
    ###TFtdcCombOffsetFlagType是一个组合开平标志类型
    #########################################################################
    ctypedef char TThostFtdcCombOffsetFlagType[5]

    #########################################################################
    ###TFtdcCombHedgeFlagType是一个组合投机套保标志类型
    #########################################################################
    ctypedef char TThostFtdcCombHedgeFlagType[5]

    #########################################################################
    ###TFtdcRatioType是一个比率类型
    #########################################################################
    ctypedef double TThostFtdcRatioType

    #########################################################################
    ###TFtdcMoneyType是一个资金类型
    #########################################################################
    ctypedef double TThostFtdcMoneyType

    #########################################################################
    ###TFtdcLargeVolumeType是一个大额数量类型
    #########################################################################
    ctypedef double TThostFtdcLargeVolumeType

    #########################################################################
    ###TFtdcSequenceSeriesType是一个序列系列号类型
    #########################################################################
    ctypedef short TThostFtdcSequenceSeriesType

    #########################################################################
    ###TFtdcCommPhaseNoType是一个通讯时段编号类型
    #########################################################################
    ctypedef short TThostFtdcCommPhaseNoType

    #########################################################################
    ###TFtdcSequenceLabelType是一个序列编号类型
    #########################################################################
    ctypedef char TThostFtdcSequenceLabelType[2]

    #########################################################################
    ###TFtdcUnderlyingMultipleType是一个基础商品乘数类型
    #########################################################################
    ctypedef double TThostFtdcUnderlyingMultipleType

    #########################################################################
    ###TFtdcPriorityType是一个优先级类型
    #########################################################################
    ctypedef int TThostFtdcPriorityType

    #########################################################################
    ###TFtdcContractCodeType是一个合同编号类型
    #########################################################################
    ctypedef char TThostFtdcContractCodeType[41]

    #########################################################################
    ###TFtdcCityType是一个市类型
    #########################################################################
    ctypedef char TThostFtdcCityType[51]

    #########################################################################
    ###TFtdcIsStockType是一个是否股民类型
    #########################################################################
    ctypedef char TThostFtdcIsStockType[11]

    #########################################################################
    ###TFtdcChannelType是一个渠道类型
    #########################################################################
    ctypedef char TThostFtdcChannelType[51]

    #########################################################################
    ###TFtdcAddressType是一个通讯地址类型
    #########################################################################
    ctypedef char TThostFtdcAddressType[101]

    #########################################################################
    ###TFtdcZipCodeType是一个邮政编码类型
    #########################################################################
    ctypedef char TThostFtdcZipCodeType[7]

    #########################################################################
    ###TFtdcTelephoneType是一个联系电话类型
    #########################################################################
    ctypedef char TThostFtdcTelephoneType[41]

    #########################################################################
    ###TFtdcFaxType是一个传真类型
    #########################################################################
    ctypedef char TThostFtdcFaxType[41]

    #########################################################################
    ###TFtdcMobileType是一个手机类型
    #########################################################################
    ctypedef char TThostFtdcMobileType[41]

    #########################################################################
    ###TFtdcEMailType是一个电子邮件类型
    #########################################################################
    ctypedef char TThostFtdcEMailType[41]

    #########################################################################
    ###TFtdcMemoType是一个备注类型
    #########################################################################
    ctypedef char TThostFtdcMemoType[161]

    #########################################################################
    ###TFtdcCompanyCodeType是一个企业代码类型
    #########################################################################
    ctypedef char TThostFtdcCompanyCodeType[51]

    #########################################################################
    ###TFtdcWebsiteType是一个网站地址类型
    #########################################################################
    ctypedef char TThostFtdcWebsiteType[51]

    #########################################################################
    ###TFtdcTaxNoType是一个税务登记号类型
    #########################################################################
    ctypedef char TThostFtdcTaxNoType[31]

    #########################################################################
    ###TFtdcBatchStatusType是一个处理状态类型
    #########################################################################
    ctypedef char TThostFtdcBatchStatusType

    #########################################################################
    ###TFtdcPropertyIDType是一个属性代码类型
    #########################################################################
    ctypedef char TThostFtdcPropertyIDType[33]

    #########################################################################
    ###TFtdcPropertyNameType是一个属性名称类型
    #########################################################################
    ctypedef char TThostFtdcPropertyNameType[65]

    #########################################################################
    ###TFtdcLicenseNoType是一个营业执照号类型
    #########################################################################
    ctypedef char TThostFtdcLicenseNoType[51]

    #########################################################################
    ###TFtdcAgentIDType是一个经纪人代码类型
    #########################################################################
    ctypedef char TThostFtdcAgentIDType[13]

    #########################################################################
    ###TFtdcAgentNameType是一个经纪人名称类型
    #########################################################################
    ctypedef char TThostFtdcAgentNameType[41]

    #########################################################################
    ###TFtdcAgentGroupIDType是一个经纪人组代码类型
    #########################################################################
    ctypedef char TThostFtdcAgentGroupIDType[13]

    #########################################################################
    ###TFtdcAgentGroupNameType是一个经纪人组名称类型
    #########################################################################
    ctypedef char TThostFtdcAgentGroupNameType[41]

    #########################################################################
    ###TFtdcReturnStyleType是一个按品种返还方式类型
    #########################################################################
    ctypedef char TThostFtdcReturnStyleType

    #########################################################################
    ###TFtdcReturnPatternType是一个返还模式类型
    #########################################################################
    ctypedef char TThostFtdcReturnPatternType

    #########################################################################
    ###TFtdcReturnLevelType是一个返还级别类型
    #########################################################################
    ctypedef char TThostFtdcReturnLevelType

    #########################################################################
    ###TFtdcReturnStandardType是一个返还标准类型
    #########################################################################
    ctypedef char TThostFtdcReturnStandardType

    #########################################################################
    ###TFtdcMortgageTypeType是一个质押类型类型
    #########################################################################
    ctypedef char TThostFtdcMortgageTypeType

    #########################################################################
    ###TFtdcInvestorSettlementParamIDType是一个投资者结算参数代码类型
    #########################################################################
    ctypedef char TThostFtdcInvestorSettlementParamIDType

    #########################################################################
    ###TFtdcExchangeSettlementParamIDType是一个交易所结算参数代码类型
    #########################################################################
    ctypedef char TThostFtdcExchangeSettlementParamIDType

    #########################################################################
    ###TFtdcSystemParamIDType是一个系统参数代码类型
    #########################################################################
    ctypedef char TThostFtdcSystemParamIDType

    #########################################################################
    ###TFtdcTradeParamIDType是一个交易系统参数代码类型
    #########################################################################
    ctypedef char TThostFtdcTradeParamIDType

    #########################################################################
    ###TFtdcSettlementParamValueType是一个参数代码值类型
    #########################################################################
    ctypedef char TThostFtdcSettlementParamValueType[256]

    #########################################################################
    ###TFtdcCounterIDType是一个计数器代码类型
    #########################################################################
    ctypedef char TThostFtdcCounterIDType[33]

    #########################################################################
    ###TFtdcInvestorGroupNameType是一个投资者分组名称类型
    #########################################################################
    ctypedef char TThostFtdcInvestorGroupNameType[41]

    #########################################################################
    ###TFtdcBrandCodeType是一个牌号类型
    #########################################################################
    ctypedef char TThostFtdcBrandCodeType[257]

    #########################################################################
    ###TFtdcWarehouseType是一个仓库类型
    #########################################################################
    ctypedef char TThostFtdcWarehouseType[257]

    #########################################################################
    ###TFtdcProductDateType是一个产期类型
    #########################################################################
    ctypedef char TThostFtdcProductDateType[41]

    #########################################################################
    ###TFtdcGradeType是一个等级类型
    #########################################################################
    ctypedef char TThostFtdcGradeType[41]

    #########################################################################
    ###TFtdcClassifyType是一个类别类型
    #########################################################################
    ctypedef char TThostFtdcClassifyType[41]

    #########################################################################
    ###TFtdcPositionType是一个货位类型
    #########################################################################
    ctypedef char TThostFtdcPositionType[41]

    #########################################################################
    ###TFtdcYieldlyType是一个产地类型
    #########################################################################
    ctypedef char TThostFtdcYieldlyType[41]

    #########################################################################
    ###TFtdcWeightType是一个公定重量类型
    #########################################################################
    ctypedef char TThostFtdcWeightType[41]

    #########################################################################
    ###TFtdcSubEntryFundNoType是一个分项资金流水号类型
    #########################################################################
    ctypedef int TThostFtdcSubEntryFundNoType

    #########################################################################
    ###TFtdcFileIDType是一个文件标识类型
    #########################################################################
    ctypedef char TThostFtdcFileIDType

    #########################################################################
    ###TFtdcFileNameType是一个文件名称类型
    #########################################################################
    ctypedef char TThostFtdcFileNameType[257]

    #########################################################################
    ###TFtdcFileTypeType是一个文件上传类型类型
    #########################################################################
    ctypedef char TThostFtdcFileTypeType

    #########################################################################
    ###TFtdcFileFormatType是一个文件格式类型
    #########################################################################
    ctypedef char TThostFtdcFileFormatType

    #########################################################################
    ###TFtdcFileUploadStatusType是一个文件状态类型
    #########################################################################
    ctypedef char TThostFtdcFileUploadStatusType

    #########################################################################
    ###TFtdcTransferDirectionType是一个移仓方向类型
    #########################################################################
    ctypedef char TThostFtdcTransferDirectionType

    #########################################################################
    ###TFtdcUploadModeType是一个上传文件类型类型
    #########################################################################
    ctypedef char TThostFtdcUploadModeType[21]

    #########################################################################
    ###TFtdcAccountIDType是一个投资者帐号类型
    #########################################################################
    ctypedef char TThostFtdcAccountIDType[13]

    #########################################################################
    ###TFtdcBankFlagType是一个银行统一标识类型类型
    #########################################################################
    ctypedef char TThostFtdcBankFlagType[4]

    #########################################################################
    ###TFtdcBankAccountType是一个银行账户类型
    #########################################################################
    ctypedef char TThostFtdcBankAccountType[41]

    #########################################################################
    ###TFtdcOpenNameType是一个银行账户的开户人名称类型
    #########################################################################
    ctypedef char TThostFtdcOpenNameType[61]

    #########################################################################
    ###TFtdcOpenBankType是一个银行账户的开户行类型
    #########################################################################
    ctypedef char TThostFtdcOpenBankType[101]

    #########################################################################
    ###TFtdcBankNameType是一个银行名称类型
    #########################################################################
    ctypedef char TThostFtdcBankNameType[101]

    #########################################################################
    ###TFtdcPublishPathType是一个发布路径类型
    #########################################################################
    ctypedef char TThostFtdcPublishPathType[257]

    #########################################################################
    ###TFtdcOperatorIDType是一个操作员代码类型
    #########################################################################
    ctypedef char TThostFtdcOperatorIDType[65]

    #########################################################################
    ###TFtdcMonthCountType是一个月份数量类型
    #########################################################################
    ctypedef int TThostFtdcMonthCountType

    #########################################################################
    ###TFtdcAdvanceMonthArrayType是一个月份提前数组类型
    #########################################################################
    ctypedef char TThostFtdcAdvanceMonthArrayType[13]

    #########################################################################
    ###TFtdcDateExprType是一个日期表达式类型
    #########################################################################
    ctypedef char TThostFtdcDateExprType[1025]

    #########################################################################
    ###TFtdcInstrumentIDExprType是一个合约代码表达式类型
    #########################################################################
    ctypedef char TThostFtdcInstrumentIDExprType[41]

    #########################################################################
    ###TFtdcInstrumentNameExprType是一个合约名称表达式类型
    #########################################################################
    ctypedef char TThostFtdcInstrumentNameExprType[41]

    #########################################################################
    ###TFtdcSpecialCreateRuleType是一个特殊的创建规则类型
    #########################################################################
    ctypedef char TThostFtdcSpecialCreateRuleType

    #########################################################################
    ###TFtdcBasisPriceTypeType是一个挂牌基准价类型类型
    #########################################################################
    ctypedef char TThostFtdcBasisPriceTypeType

    #########################################################################
    ###TFtdcProductLifePhaseType是一个产品生命周期状态类型
    #########################################################################
    ctypedef char TThostFtdcProductLifePhaseType

    #########################################################################
    ###TFtdcDeliveryModeType是一个交割方式类型
    #########################################################################
    ctypedef char TThostFtdcDeliveryModeType

    #########################################################################
    ###TFtdcLogLevelType是一个日志级别类型
    #########################################################################
    ctypedef char TThostFtdcLogLevelType[33]

    #########################################################################
    ###TFtdcProcessNameType是一个存储过程名称类型
    #########################################################################
    ctypedef char TThostFtdcProcessNameType[257]

    #########################################################################
    ###TFtdcOperationMemoType是一个操作摘要类型
    #########################################################################
    ctypedef char TThostFtdcOperationMemoType[1025]

    #########################################################################
    ###TFtdcFundIOTypeType是一个出入金类型类型
    #########################################################################
    ctypedef char TThostFtdcFundIOTypeType

    #########################################################################
    ###TFtdcFundTypeType是一个资金类型类型
    #########################################################################
    ctypedef char TThostFtdcFundTypeType

    #########################################################################
    ###TFtdcFundDirectionType是一个出入金方向类型
    #########################################################################
    ctypedef char TThostFtdcFundDirectionType

    #########################################################################
    ###TFtdcFundStatusType是一个资金状态类型
    #########################################################################
    ctypedef char TThostFtdcFundStatusType

    #########################################################################
    ###TFtdcBillNoType是一个票据号类型
    #########################################################################
    ctypedef char TThostFtdcBillNoType[15]

    #########################################################################
    ###TFtdcBillNameType是一个票据名称类型
    #########################################################################
    ctypedef char TThostFtdcBillNameType[33]

    #########################################################################
    ###TFtdcPublishStatusType是一个发布状态类型
    #########################################################################
    ctypedef char TThostFtdcPublishStatusType

    #########################################################################
    ###TFtdcEnumValueIDType是一个枚举值代码类型
    #########################################################################
    ctypedef char TThostFtdcEnumValueIDType[65]

    #########################################################################
    ###TFtdcEnumValueTypeType是一个枚举值类型类型
    #########################################################################
    ctypedef char TThostFtdcEnumValueTypeType[33]

    #########################################################################
    ###TFtdcEnumValueLabelType是一个枚举值名称类型
    #########################################################################
    ctypedef char TThostFtdcEnumValueLabelType[65]

    #########################################################################
    ###TFtdcEnumValueResultType是一个枚举值结果类型
    #########################################################################
    ctypedef char TThostFtdcEnumValueResultType[33]

    #########################################################################
    ###TFtdcSystemStatusType是一个系统状态类型
    #########################################################################
    ctypedef char TThostFtdcSystemStatusType

    #########################################################################
    ###TFtdcSettlementStatusType是一个结算状态类型
    #########################################################################
    ctypedef char TThostFtdcSettlementStatusType

    #########################################################################
    ###TFtdcRangeIntTypeType是一个限定值类型类型
    #########################################################################
    ctypedef char TThostFtdcRangeIntTypeType[33]

    #########################################################################
    ###TFtdcRangeIntFromType是一个限定值下限类型
    #########################################################################
    ctypedef char TThostFtdcRangeIntFromType[33]

    #########################################################################
    ###TFtdcRangeIntToType是一个限定值上限类型
    #########################################################################
    ctypedef char TThostFtdcRangeIntToType[33]

    #########################################################################
    ###TFtdcFunctionIDType是一个功能代码类型
    #########################################################################
    ctypedef char TThostFtdcFunctionIDType[25]

    #########################################################################
    ###TFtdcFunctionValueCodeType是一个功能编码类型
    #########################################################################
    ctypedef char TThostFtdcFunctionValueCodeType[257]

    #########################################################################
    ###TFtdcFunctionNameType是一个功能名称类型
    #########################################################################
    ctypedef char TThostFtdcFunctionNameType[65]

    #########################################################################
    ###TFtdcRoleIDType是一个角色编号类型
    #########################################################################
    ctypedef char TThostFtdcRoleIDType[11]

    #########################################################################
    ###TFtdcRoleNameType是一个角色名称类型
    #########################################################################
    ctypedef char TThostFtdcRoleNameType[41]

    #########################################################################
    ###TFtdcDescriptionType是一个描述类型
    #########################################################################
    ctypedef char TThostFtdcDescriptionType[401]

    #########################################################################
    ###TFtdcCombineIDType是一个组合编号类型
    #########################################################################
    ctypedef char TThostFtdcCombineIDType[25]

    #########################################################################
    ###TFtdcCombineTypeType是一个组合类型类型
    #########################################################################
    ctypedef char TThostFtdcCombineTypeType[25]

    #########################################################################
    ###TFtdcInvestorTypeType是一个投资者类型类型
    #########################################################################
    ctypedef char TThostFtdcInvestorTypeType

    #########################################################################
    ###TFtdcBrokerTypeType是一个经纪公司类型类型
    #########################################################################
    ctypedef char TThostFtdcBrokerTypeType

    #########################################################################
    ###TFtdcRiskLevelType是一个风险等级类型
    #########################################################################
    ctypedef char TThostFtdcRiskLevelType

    #########################################################################
    ###TFtdcFeeAcceptStyleType是一个手续费收取方式类型
    #########################################################################
    ctypedef char TThostFtdcFeeAcceptStyleType

    #########################################################################
    ###TFtdcPasswordTypeType是一个密码类型类型
    #########################################################################
    ctypedef char TThostFtdcPasswordTypeType

    #########################################################################
    ###TFtdcAlgorithmType是一个盈亏算法类型
    #########################################################################
    ctypedef char TThostFtdcAlgorithmType

    #########################################################################
    ###TFtdcIncludeCloseProfitType是一个是否包含平仓盈利类型
    #########################################################################
    ctypedef char TThostFtdcIncludeCloseProfitType

    #########################################################################
    ###TFtdcAllWithoutTradeType是一个是否受可提比例限制类型
    #########################################################################
    ctypedef char TThostFtdcAllWithoutTradeType

    #########################################################################
    ###TFtdcCommentType是一个盈亏算法说明类型
    #########################################################################
    ctypedef char TThostFtdcCommentType[31]

    #########################################################################
    ###TFtdcVersionType是一个版本号类型
    #########################################################################
    ctypedef char TThostFtdcVersionType[4]

    #########################################################################
    ###TFtdcTradeCodeType是一个交易代码类型
    #########################################################################
    ctypedef char TThostFtdcTradeCodeType[7]

    #########################################################################
    ###TFtdcTradeDateType是一个交易日期类型
    #########################################################################
    ctypedef char TThostFtdcTradeDateType[9]

    #########################################################################
    ###TFtdcTradeTimeType是一个交易时间类型
    #########################################################################
    ctypedef char TThostFtdcTradeTimeType[9]

    #########################################################################
    ###TFtdcTradeSerialType是一个发起方流水号类型
    #########################################################################
    ctypedef char TThostFtdcTradeSerialType[9]

    #########################################################################
    ###TFtdcTradeSerialNoType是一个发起方流水号类型
    #########################################################################
    ctypedef int TThostFtdcTradeSerialNoType

    #########################################################################
    ###TFtdcFutureIDType是一个期货公司代码类型
    #########################################################################
    ctypedef char TThostFtdcFutureIDType[11]

    #########################################################################
    ###TFtdcBankIDType是一个银行代码类型
    #########################################################################
    ctypedef char TThostFtdcBankIDType[4]

    #########################################################################
    ###TFtdcBankBrchIDType是一个银行分中心代码类型
    #########################################################################
    ctypedef char TThostFtdcBankBrchIDType[5]

    #########################################################################
    ###TFtdcBankBranchIDType是一个分中心代码类型
    #########################################################################
    ctypedef char TThostFtdcBankBranchIDType[11]

    #########################################################################
    ###TFtdcOperNoType是一个交易柜员类型
    #########################################################################
    ctypedef char TThostFtdcOperNoType[17]

    #########################################################################
    ###TFtdcDeviceIDType是一个渠道标志类型
    #########################################################################
    ctypedef char TThostFtdcDeviceIDType[3]

    #########################################################################
    ###TFtdcRecordNumType是一个记录数类型
    #########################################################################
    ctypedef char TThostFtdcRecordNumType[7]

    #########################################################################
    ###TFtdcFutureAccountType是一个期货资金账号类型
    #########################################################################
    ctypedef char TThostFtdcFutureAccountType[22]

    #########################################################################
    ###TFtdcFuturePwdFlagType是一个资金密码核对标志类型
    #########################################################################
    ctypedef char TThostFtdcFuturePwdFlagType

    #########################################################################
    ###TFtdcTransferTypeType是一个银期转账类型类型
    #########################################################################
    ctypedef char TThostFtdcTransferTypeType

    #########################################################################
    ###TFtdcFutureAccPwdType是一个期货资金密码类型
    #########################################################################
    ctypedef char TThostFtdcFutureAccPwdType[17]

    #########################################################################
    ###TFtdcCurrencyCodeType是一个币种类型
    #########################################################################
    ctypedef char TThostFtdcCurrencyCodeType[4]

    #########################################################################
    ###TFtdcRetCodeType是一个响应代码类型
    #########################################################################
    ctypedef char TThostFtdcRetCodeType[5]

    #########################################################################
    ###TFtdcRetInfoType是一个响应信息类型
    #########################################################################
    ctypedef char TThostFtdcRetInfoType[129]

    #########################################################################
    ###TFtdcTradeAmtType是一个银行总余额类型
    #########################################################################
    ctypedef char TThostFtdcTradeAmtType[20]

    #########################################################################
    ###TFtdcUseAmtType是一个银行可用余额类型
    #########################################################################
    ctypedef char TThostFtdcUseAmtType[20]

    #########################################################################
    ###TFtdcFetchAmtType是一个银行可取余额类型
    #########################################################################
    ctypedef char TThostFtdcFetchAmtType[20]

    #########################################################################
    ###TFtdcTransferValidFlagType是一个转账有效标志类型
    #########################################################################
    ctypedef char TThostFtdcTransferValidFlagType

    #########################################################################
    ###TFtdcCertCodeType是一个证件号码类型
    #########################################################################
    ctypedef char TThostFtdcCertCodeType[21]

    #########################################################################
    ###TFtdcReasonType是一个事由类型
    #########################################################################
    ctypedef char TThostFtdcReasonType

    #########################################################################
    ###TFtdcFundProjectIDType是一个资金项目编号类型
    #########################################################################
    ctypedef char TThostFtdcFundProjectIDType[5]

    #########################################################################
    ###TFtdcSexType是一个性别类型
    #########################################################################
    ctypedef char TThostFtdcSexType

    #########################################################################
    ###TFtdcProfessionType是一个职业类型
    #########################################################################
    ctypedef char TThostFtdcProfessionType[101]

    #########################################################################
    ###TFtdcNationalType是一个国籍类型
    #########################################################################
    ctypedef char TThostFtdcNationalType[31]

    #########################################################################
    ###TFtdcProvinceType是一个省类型
    #########################################################################
    ctypedef char TThostFtdcProvinceType[51]

    #########################################################################
    ###TFtdcRegionType是一个区类型
    #########################################################################
    ctypedef char TThostFtdcRegionType[16]

    #########################################################################
    ###TFtdcCountryType是一个国家类型
    #########################################################################
    ctypedef char TThostFtdcCountryType[16]

    #########################################################################
    ###TFtdcLicenseNOType是一个营业执照类型
    #########################################################################
    ctypedef char TThostFtdcLicenseNOType[33]

    #########################################################################
    ###TFtdcCompanyTypeType是一个企业性质类型
    #########################################################################
    ctypedef char TThostFtdcCompanyTypeType[16]

    #########################################################################
    ###TFtdcBusinessScopeType是一个经营范围类型
    #########################################################################
    ctypedef char TThostFtdcBusinessScopeType[1001]

    #########################################################################
    ###TFtdcCapitalCurrencyType是一个注册资本币种类型
    #########################################################################
    ctypedef char TThostFtdcCapitalCurrencyType[4]

    #########################################################################
    ###TFtdcUserTypeType是一个用户类型类型
    #########################################################################
    ctypedef char TThostFtdcUserTypeType

    #########################################################################
    ###TFtdcRateTypeType是一个费率类型类型
    #########################################################################
    ctypedef char TThostFtdcRateTypeType

    #########################################################################
    ###TFtdcNoteTypeType是一个通知类型类型
    #########################################################################
    ctypedef char TThostFtdcNoteTypeType

    #########################################################################
    ###TFtdcSettlementStyleType是一个结算单方式类型
    #########################################################################
    ctypedef char TThostFtdcSettlementStyleType

    #########################################################################
    ###TFtdcBrokerDNSType是一个域名类型
    #########################################################################
    ctypedef char TThostFtdcBrokerDNSType[256]

    #########################################################################
    ###TFtdcSentenceType是一个语句类型
    #########################################################################
    ctypedef char TThostFtdcSentenceType[501]

    #########################################################################
    ###TFtdcSettlementBillTypeType是一个结算单类型类型
    #########################################################################
    ctypedef char TThostFtdcSettlementBillTypeType

    #########################################################################
    ###TFtdcUserRightTypeType是一个客户权限类型类型
    #########################################################################
    ctypedef char TThostFtdcUserRightTypeType

    #########################################################################
    ###TFtdcMarginPriceTypeType是一个保证金价格类型类型
    #########################################################################
    ctypedef char TThostFtdcMarginPriceTypeType

    #########################################################################
    ###TFtdcBillGenStatusType是一个结算单生成状态类型
    #########################################################################
    ctypedef char TThostFtdcBillGenStatusType

    #########################################################################
    ###TFtdcAlgoTypeType是一个算法类型类型
    #########################################################################
    ctypedef char TThostFtdcAlgoTypeType

    #########################################################################
    ###TFtdcHandlePositionAlgoIDType是一个持仓处理算法编号类型
    #########################################################################
    ctypedef char TThostFtdcHandlePositionAlgoIDType

    #########################################################################
    ###TFtdcFindMarginRateAlgoIDType是一个寻找保证金率算法编号类型
    #########################################################################
    ctypedef char TThostFtdcFindMarginRateAlgoIDType

    #########################################################################
    ###TFtdcHandleTradingAccountAlgoIDType是一个资金处理算法编号类型
    #########################################################################
    ctypedef char TThostFtdcHandleTradingAccountAlgoIDType

    #########################################################################
    ###TFtdcPersonTypeType是一个联系人类型类型
    #########################################################################
    ctypedef char TThostFtdcPersonTypeType

    #########################################################################
    ###TFtdcQueryInvestorRangeType是一个查询范围类型
    #########################################################################
    ctypedef char TThostFtdcQueryInvestorRangeType

    #########################################################################
    ###TFtdcInvestorRiskStatusType是一个投资者风险状态类型
    #########################################################################
    ctypedef char TThostFtdcInvestorRiskStatusType

    #########################################################################
    ###TFtdcLegIDType是一个单腿编号类型
    #########################################################################
    ctypedef int TThostFtdcLegIDType

    #########################################################################
    ###TFtdcLegMultipleType是一个单腿乘数类型
    #########################################################################
    ctypedef int TThostFtdcLegMultipleType

    #########################################################################
    ###TFtdcImplyLevelType是一个派生层数类型
    #########################################################################
    ctypedef int TThostFtdcImplyLevelType

    #########################################################################
    ###TFtdcClearAccountType是一个结算账户类型
    #########################################################################
    ctypedef char TThostFtdcClearAccountType[33]

    #########################################################################
    ###TFtdcOrganNOType是一个结算账户类型
    #########################################################################
    ctypedef char TThostFtdcOrganNOType[6]

    #########################################################################
    ###TFtdcClearbarchIDType是一个结算账户联行号类型
    #########################################################################
    ctypedef char TThostFtdcClearbarchIDType[6]

    #########################################################################
    ###TFtdcUserEventTypeType是一个用户事件类型类型
    #########################################################################
    ctypedef char TThostFtdcUserEventTypeType

    #########################################################################
    ###TFtdcUserEventInfoType是一个用户事件信息类型
    #########################################################################
    ctypedef char TThostFtdcUserEventInfoType[1025]

    #########################################################################
    ###TFtdcCloseStyleType是一个平仓方式类型
    #########################################################################
    ctypedef char TThostFtdcCloseStyleType

    #########################################################################
    ###TFtdcStatModeType是一个统计方式类型
    #########################################################################
    ctypedef char TThostFtdcStatModeType

    #########################################################################
    ###TFtdcParkedOrderStatusType是一个预埋单状态类型
    #########################################################################
    ctypedef char TThostFtdcParkedOrderStatusType

    #########################################################################
    ###TFtdcParkedOrderIDType是一个预埋报单编号类型
    #########################################################################
    ctypedef char TThostFtdcParkedOrderIDType[13]

    #########################################################################
    ###TFtdcParkedOrderActionIDType是一个预埋撤单编号类型
    #########################################################################
    ctypedef char TThostFtdcParkedOrderActionIDType[13]

    #########################################################################
    ###TFtdcVirDealStatusType是一个处理状态类型
    #########################################################################
    ctypedef char TThostFtdcVirDealStatusType

    #########################################################################
    ###TFtdcOrgSystemIDType是一个原有系统代码类型
    #########################################################################
    ctypedef char TThostFtdcOrgSystemIDType

    #########################################################################
    ###TFtdcVirTradeStatusType是一个交易状态类型
    #########################################################################
    ctypedef char TThostFtdcVirTradeStatusType

    #########################################################################
    ###TFtdcVirBankAccTypeType是一个银行帐户类型类型
    #########################################################################
    ctypedef char TThostFtdcVirBankAccTypeType

    #########################################################################
    ###TFtdcVirementStatusType是一个银行帐户类型类型
    #########################################################################
    ctypedef char TThostFtdcVirementStatusType

    #########################################################################
    ###TFtdcVirementAvailAbilityType是一个有效标志类型
    #########################################################################
    ctypedef char TThostFtdcVirementAvailAbilityType

    #########################################################################
    ###TFtdcVirementTradeCodeType是一个交易代码类型
    #########################################################################
    ctypedef char TThostFtdcVirementTradeCodeType

    #########################################################################
    ###TFtdcPhotoTypeNameType是一个影像类型名称类型
    #########################################################################
    ctypedef char TThostFtdcPhotoTypeNameType[41]

    #########################################################################
    ###TFtdcPhotoTypeIDType是一个影像类型代码类型
    #########################################################################
    ctypedef char TThostFtdcPhotoTypeIDType[5]

    #########################################################################
    ###TFtdcPhotoNameType是一个影像名称类型
    #########################################################################
    ctypedef char TThostFtdcPhotoNameType[161]

    #########################################################################
    ###TFtdcTopicIDType是一个主题代码类型
    #########################################################################
    ctypedef int TThostFtdcTopicIDType

    #########################################################################
    ###TFtdcReportTypeIDType是一个交易报告类型标识类型
    #########################################################################
    ctypedef char TThostFtdcReportTypeIDType[3]

    #########################################################################
    ###TFtdcCharacterIDType是一个交易特征代码类型
    #########################################################################
    ctypedef char TThostFtdcCharacterIDType[5]

    #########################################################################
    ###TFtdcAMLParamIDType是一个参数代码类型
    #########################################################################
    ctypedef char TThostFtdcAMLParamIDType[21]

    #########################################################################
    ###TFtdcAMLInvestorTypeType是一个投资者类型类型
    #########################################################################
    ctypedef char TThostFtdcAMLInvestorTypeType[3]

    #########################################################################
    ###TFtdcAMLIdCardTypeType是一个证件类型类型
    #########################################################################
    ctypedef char TThostFtdcAMLIdCardTypeType[3]

    #########################################################################
    ###TFtdcAMLTradeDirectType是一个资金进出方向类型
    #########################################################################
    ctypedef char TThostFtdcAMLTradeDirectType[3]

    #########################################################################
    ###TFtdcAMLTradeModelType是一个资金进出方式类型
    #########################################################################
    ctypedef char TThostFtdcAMLTradeModelType[3]

    #########################################################################
    ###TFtdcAMLParamIDType是一个参数代码类型
    #########################################################################
    ctypedef char TThostFtdcAMLParamIDType[21]

    #########################################################################
    ###TFtdcAMLOpParamValueType是一个业务参数代码值类型
    #########################################################################
    ctypedef double TThostFtdcAMLOpParamValueType

    #########################################################################
    ###TFtdcAMLCustomerCardTypeType是一个客户身份证件#证明文件类型类型
    #########################################################################
    ctypedef char TThostFtdcAMLCustomerCardTypeType[81]

    #########################################################################
    ###TFtdcAMLInstitutionNameType是一个金融机构网点名称类型
    #########################################################################
    ctypedef char TThostFtdcAMLInstitutionNameType[65]

    #########################################################################
    ###TFtdcAMLDistrictIDType是一个金融机构网点所在地区行政区划代码类型
    #########################################################################
    ctypedef char TThostFtdcAMLDistrictIDType[7]

    #########################################################################
    ###TFtdcAMLRelationShipType是一个金融机构网点与大额交易的关系类型
    #########################################################################
    ctypedef char TThostFtdcAMLRelationShipType[3]

    #########################################################################
    ###TFtdcAMLInstitutionTypeType是一个金融机构网点代码类型类型
    #########################################################################
    ctypedef char TThostFtdcAMLInstitutionTypeType[3]

    #########################################################################
    ###TFtdcAMLInstitutionIDType是一个金融机构网点代码类型
    #########################################################################
    ctypedef char TThostFtdcAMLInstitutionIDType[13]

    #########################################################################
    ###TFtdcAMLAccountTypeType是一个账户类型类型
    #########################################################################
    ctypedef char TThostFtdcAMLAccountTypeType[5]

    #########################################################################
    ###TFtdcAMLTradingTypeType是一个交易方式类型
    #########################################################################
    ctypedef char TThostFtdcAMLTradingTypeType[7]

    #########################################################################
    ###TFtdcAMLTransactClassType是一个涉外收支交易分类与代码类型
    #########################################################################
    ctypedef char TThostFtdcAMLTransactClassType[7]

    #########################################################################
    ###TFtdcAMLCapitalIOType是一个资金收付标识类型
    #########################################################################
    ctypedef char TThostFtdcAMLCapitalIOType[3]

    #########################################################################
    ###TFtdcAMLSiteType是一个交易地点类型
    #########################################################################
    ctypedef char TThostFtdcAMLSiteType[10]

    #########################################################################
    ###TFtdcAMLCapitalPurposeType是一个资金用途类型
    #########################################################################
    ctypedef char TThostFtdcAMLCapitalPurposeType[129]

    #########################################################################
    ###TFtdcAMLReportTypeType是一个报文类型类型
    #########################################################################
    ctypedef char TThostFtdcAMLReportTypeType[2]

    #########################################################################
    ###TFtdcAMLSerialNoType是一个编号类型
    #########################################################################
    ctypedef char TThostFtdcAMLSerialNoType[5]

    #########################################################################
    ###TFtdcAMLStatusType是一个状态类型
    #########################################################################
    ctypedef char TThostFtdcAMLStatusType[2]

    #########################################################################
    ###TFtdcAMLGenStatusType是一个Aml生成方式类型
    #########################################################################
    ctypedef char TThostFtdcAMLGenStatusType

    #########################################################################
    ###TFtdcAMLSeqCodeType是一个业务标识号类型
    #########################################################################
    ctypedef char TThostFtdcAMLSeqCodeType[65]

    #########################################################################
    ###TFtdcAMLFileNameType是一个AML文件名类型
    #########################################################################
    ctypedef char TThostFtdcAMLFileNameType[257]

    #########################################################################
    ###TFtdcAMLMoneyType是一个反洗钱资金类型
    #########################################################################
    ctypedef double TThostFtdcAMLMoneyType

    #########################################################################
    ###TFtdcAMLFileAmountType是一个反洗钱资金类型
    #########################################################################
    ctypedef int TThostFtdcAMLFileAmountType

    #########################################################################
    ###TFtdcCFMMCKeyType是一个密钥类型(保证金监管)类型
    #########################################################################
    ctypedef char TThostFtdcCFMMCKeyType[21]

    #########################################################################
    ###TFtdcCFMMCTokenType是一个令牌类型(保证金监管)类型
    #########################################################################
    ctypedef char TThostFtdcCFMMCTokenType[21]

    #########################################################################
    ###TFtdcCFMMCKeyKindType是一个动态密钥类别(保证金监管)类型
    #########################################################################
    ctypedef char TThostFtdcCFMMCKeyKindType

    #########################################################################
    ###TFtdcAMLReportNameType是一个报文名称类型
    #########################################################################
    ctypedef char TThostFtdcAMLReportNameType[81]

    #########################################################################
    ###TFtdcIndividualNameType是一个个人姓名类型
    #########################################################################
    ctypedef char TThostFtdcIndividualNameType[51]

    #########################################################################
    ###TFtdcCurrencyIDType是一个币种代码类型
    #########################################################################
    ctypedef char TThostFtdcCurrencyIDType[4]

    #########################################################################
    ###TFtdcCustNumberType是一个客户编号类型
    #########################################################################
    ctypedef char TThostFtdcCustNumberType[36]

    #########################################################################
    ###TFtdcOrganCodeType是一个机构编码类型
    #########################################################################
    ctypedef char TThostFtdcOrganCodeType[36]

    #########################################################################
    ###TFtdcOrganNameType是一个机构名称类型
    #########################################################################
    ctypedef char TThostFtdcOrganNameType[71]

    #########################################################################
    ###TFtdcSuperOrganCodeType是一个上级机构编码,即期货公司总部、银行总行类型
    #########################################################################
    ctypedef char TThostFtdcSuperOrganCodeType[12]

    #########################################################################
    ###TFtdcSubBranchIDType是一个分支机构类型
    #########################################################################
    ctypedef char TThostFtdcSubBranchIDType[31]

    #########################################################################
    ###TFtdcSubBranchNameType是一个分支机构名称类型
    #########################################################################
    ctypedef char TThostFtdcSubBranchNameType[71]

    #########################################################################
    ###TFtdcBranchNetCodeType是一个机构网点号类型
    #########################################################################
    ctypedef char TThostFtdcBranchNetCodeType[31]

    #########################################################################
    ###TFtdcBranchNetNameType是一个机构网点名称类型
    #########################################################################
    ctypedef char TThostFtdcBranchNetNameType[71]

    #########################################################################
    ###TFtdcOrganFlagType是一个机构标识类型
    #########################################################################
    ctypedef char TThostFtdcOrganFlagType[2]

    #########################################################################
    ###TFtdcBankCodingForFutureType是一个银行对期货公司的编码类型
    #########################################################################
    ctypedef char TThostFtdcBankCodingForFutureType[33]

    #########################################################################
    ###TFtdcBankReturnCodeType是一个银行对返回码的定义类型
    #########################################################################
    ctypedef char TThostFtdcBankReturnCodeType[7]

    #########################################################################
    ###TFtdcPlateReturnCodeType是一个银期转帐平台对返回码的定义类型
    #########################################################################
    ctypedef char TThostFtdcPlateReturnCodeType[5]

    #########################################################################
    ###TFtdcBankSubBranchIDType是一个银行分支机构编码类型
    #########################################################################
    ctypedef char TThostFtdcBankSubBranchIDType[31]

    #########################################################################
    ###TFtdcFutureBranchIDType是一个期货分支机构编码类型
    #########################################################################
    ctypedef char TThostFtdcFutureBranchIDType[31]

    #########################################################################
    ###TFtdcReturnCodeType是一个返回代码类型
    #########################################################################
    ctypedef char TThostFtdcReturnCodeType[7]

    #########################################################################
    ###TFtdcOperatorCodeType是一个操作员类型
    #########################################################################
    ctypedef char TThostFtdcOperatorCodeType[17]

    #########################################################################
    ###TFtdcClearDepIDType是一个机构结算帐户机构号类型
    #########################################################################
    ctypedef char TThostFtdcClearDepIDType[6]

    #########################################################################
    ###TFtdcClearBrchIDType是一个机构结算帐户联行号类型
    #########################################################################
    ctypedef char TThostFtdcClearBrchIDType[6]

    #########################################################################
    ###TFtdcClearNameType是一个机构结算帐户名称类型
    #########################################################################
    ctypedef char TThostFtdcClearNameType[71]

    #########################################################################
    ###TFtdcBankAccountNameType是一个银行帐户名称类型
    #########################################################################
    ctypedef char TThostFtdcBankAccountNameType[71]

    #########################################################################
    ###TFtdcInvDepIDType是一个机构投资人账号机构号类型
    #########################################################################
    ctypedef char TThostFtdcInvDepIDType[6]

    #########################################################################
    ###TFtdcInvBrchIDType是一个机构投资人联行号类型
    #########################################################################
    ctypedef char TThostFtdcInvBrchIDType[6]

    #########################################################################
    ###TFtdcMessageFormatVersionType是一个信息格式版本类型
    #########################################################################
    ctypedef char TThostFtdcMessageFormatVersionType[36]

    #########################################################################
    ###TFtdcDigestType是一个摘要类型
    #########################################################################
    ctypedef char TThostFtdcDigestType[36]

    #########################################################################
    ###TFtdcAuthenticDataType是一个认证数据类型
    #########################################################################
    ctypedef char TThostFtdcAuthenticDataType[129]

    #########################################################################
    ###TFtdcPasswordKeyType是一个密钥类型
    #########################################################################
    ctypedef char TThostFtdcPasswordKeyType[129]

    #########################################################################
    ###TFtdcFutureAccountNameType是一个期货帐户名称类型
    #########################################################################
    ctypedef char TThostFtdcFutureAccountNameType[129]

    #########################################################################
    ###TFtdcMobilePhoneType是一个手机类型
    #########################################################################
    ctypedef char TThostFtdcMobilePhoneType[21]

    #########################################################################
    ###TFtdcFutureMainKeyType是一个期货公司主密钥类型
    #########################################################################
    ctypedef char TThostFtdcFutureMainKeyType[129]

    #########################################################################
    ###TFtdcFutureWorkKeyType是一个期货公司工作密钥类型
    #########################################################################
    ctypedef char TThostFtdcFutureWorkKeyType[129]

    #########################################################################
    ###TFtdcFutureTransKeyType是一个期货公司传输密钥类型
    #########################################################################
    ctypedef char TThostFtdcFutureTransKeyType[129]

    #########################################################################
    ###TFtdcBankMainKeyType是一个银行主密钥类型
    #########################################################################
    ctypedef char TThostFtdcBankMainKeyType[129]

    #########################################################################
    ###TFtdcBankWorkKeyType是一个银行工作密钥类型
    #########################################################################
    ctypedef char TThostFtdcBankWorkKeyType[129]

    #########################################################################
    ###TFtdcBankTransKeyType是一个银行传输密钥类型
    #########################################################################
    ctypedef char TThostFtdcBankTransKeyType[129]

    #########################################################################
    ###TFtdcBankServerDescriptionType是一个银行服务器描述信息类型
    #########################################################################
    ctypedef char TThostFtdcBankServerDescriptionType[129]

    #########################################################################
    ###TFtdcAddInfoType是一个附加信息类型
    #########################################################################
    ctypedef char TThostFtdcAddInfoType[129]

    #########################################################################
    ###TFtdcDescrInfoForReturnCodeType是一个返回码描述类型
    #########################################################################
    ctypedef char TThostFtdcDescrInfoForReturnCodeType[129]

    #########################################################################
    ###TFtdcCountryCodeType是一个国家代码类型
    #########################################################################
    ctypedef char TThostFtdcCountryCodeType[21]

    #########################################################################
    ###TFtdcSerialType是一个流水号类型
    #########################################################################
    ctypedef int TThostFtdcSerialType

    #########################################################################
    ###TFtdcPlateSerialType是一个平台流水号类型
    #########################################################################
    ctypedef int TThostFtdcPlateSerialType

    #########################################################################
    ###TFtdcBankSerialType是一个银行流水号类型
    #########################################################################
    ctypedef char TThostFtdcBankSerialType[13]

    #########################################################################
    ###TFtdcCorrectSerialType是一个被冲正交易流水号类型
    #########################################################################
    ctypedef int TThostFtdcCorrectSerialType

    #########################################################################
    ###TFtdcFutureSerialType是一个期货公司流水号类型
    #########################################################################
    ctypedef int TThostFtdcFutureSerialType

    #########################################################################
    ###TFtdcApplicationIDType是一个应用标识类型
    #########################################################################
    ctypedef int TThostFtdcApplicationIDType

    #########################################################################
    ###TFtdcBankProxyIDType是一个银行代理标识类型
    #########################################################################
    ctypedef int TThostFtdcBankProxyIDType

    #########################################################################
    ###TFtdcFBTCoreIDType是一个银期转帐核心系统标识类型
    #########################################################################
    ctypedef int TThostFtdcFBTCoreIDType

    #########################################################################
    ###TFtdcServerPortType是一个服务端口号类型
    #########################################################################
    ctypedef int TThostFtdcServerPortType

    #########################################################################
    ###TFtdcRepealedTimesType是一个已经冲正次数类型
    #########################################################################
    ctypedef int TThostFtdcRepealedTimesType

    #########################################################################
    ###TFtdcRepealTimeIntervalType是一个冲正时间间隔类型
    #########################################################################
    ctypedef int TThostFtdcRepealTimeIntervalType

    #########################################################################
    ###TFtdcTotalTimesType是一个每日累计转帐次数类型
    #########################################################################
    ctypedef int TThostFtdcTotalTimesType

    #########################################################################
    ###TFtdcFBTRequestIDType是一个请求ID类型
    #########################################################################
    ctypedef int TThostFtdcFBTRequestIDType

    #########################################################################
    ###TFtdcTIDType是一个交易ID类型
    #########################################################################
    ctypedef int TThostFtdcTIDType

    #########################################################################
    ###TFtdcTradeAmountType是一个交易金额（元）类型
    #########################################################################
    ctypedef double TThostFtdcTradeAmountType

    #########################################################################
    ###TFtdcCustFeeType是一个应收客户费用（元）类型
    #########################################################################
    ctypedef double TThostFtdcCustFeeType

    #########################################################################
    ###TFtdcFutureFeeType是一个应收期货公司费用（元）类型
    #########################################################################
    ctypedef double TThostFtdcFutureFeeType

    #########################################################################
    ###TFtdcSingleMaxAmtType是一个单笔最高限额类型
    #########################################################################
    ctypedef double TThostFtdcSingleMaxAmtType

    #########################################################################
    ###TFtdcSingleMinAmtType是一个单笔最低限额类型
    #########################################################################
    ctypedef double TThostFtdcSingleMinAmtType

    #########################################################################
    ###TFtdcTotalAmtType是一个每日累计转帐额度类型
    #########################################################################
    ctypedef double TThostFtdcTotalAmtType

    #########################################################################
    ###TFtdcCertificationTypeType是一个证件类型类型
    #########################################################################
    ctypedef char TThostFtdcCertificationTypeType

    #########################################################################
    ###TFtdcFileBusinessCodeType是一个文件业务功能类型
    #########################################################################
    ctypedef char TThostFtdcFileBusinessCodeType

    #########################################################################
    ###TFtdcCashExchangeCodeType是一个汇钞标志类型
    #########################################################################
    ctypedef char TThostFtdcCashExchangeCodeType

    #########################################################################
    ###TFtdcYesNoIndicatorType是一个是或否标识类型
    #########################################################################
    ctypedef char TThostFtdcYesNoIndicatorType

    #########################################################################
    ###TFtdcBanlanceTypeType是一个余额类型类型
    #########################################################################
    ctypedef char TThostFtdcBanlanceTypeType

    #########################################################################
    ###TFtdcGenderType是一个性别类型
    #########################################################################
    ctypedef char TThostFtdcGenderType

    #########################################################################
    ###TFtdcFeePayFlagType是一个费用支付标志类型
    #########################################################################
    ctypedef char TThostFtdcFeePayFlagType

    #########################################################################
    ###TFtdcPassWordKeyTypeType是一个密钥类型类型
    #########################################################################
    ctypedef char TThostFtdcPassWordKeyTypeType

    #########################################################################
    ###TFtdcFBTPassWordTypeType是一个密码类型类型
    #########################################################################
    ctypedef char TThostFtdcFBTPassWordTypeType

    #########################################################################
    ###TFtdcFBTEncryModeType是一个加密方式类型
    #########################################################################
    ctypedef char TThostFtdcFBTEncryModeType

    #########################################################################
    ###TFtdcBankRepealFlagType是一个银行冲正标志类型
    #########################################################################
    ctypedef char TThostFtdcBankRepealFlagType

    #########################################################################
    ###TFtdcBrokerRepealFlagType是一个期商冲正标志类型
    #########################################################################
    ctypedef char TThostFtdcBrokerRepealFlagType

    #########################################################################
    ###TFtdcInstitutionTypeType是一个机构类别类型
    #########################################################################
    ctypedef char TThostFtdcInstitutionTypeType

    #########################################################################
    ###TFtdcLastFragmentType是一个最后分片标志类型
    #########################################################################
    ctypedef char TThostFtdcLastFragmentType

    #########################################################################
    ###TFtdcBankAccStatusType是一个银行账户状态类型
    #########################################################################
    ctypedef char TThostFtdcBankAccStatusType

    #########################################################################
    ###TFtdcMoneyAccountStatusType是一个资金账户状态类型
    #########################################################################
    ctypedef char TThostFtdcMoneyAccountStatusType

    #########################################################################
    ###TFtdcManageStatusType是一个存管状态类型
    #########################################################################
    ctypedef char TThostFtdcManageStatusType

    #########################################################################
    ###TFtdcSystemTypeType是一个应用系统类型类型
    #########################################################################
    ctypedef char TThostFtdcSystemTypeType

    #########################################################################
    ###TFtdcTxnEndFlagType是一个银期转帐划转结果标志类型
    #########################################################################
    ctypedef char TThostFtdcTxnEndFlagType

    #########################################################################
    ###TFtdcProcessStatusType是一个银期转帐服务处理状态类型
    #########################################################################
    ctypedef char TThostFtdcProcessStatusType

    #########################################################################
    ###TFtdcCustTypeType是一个客户类型类型
    #########################################################################
    ctypedef char TThostFtdcCustTypeType

    #########################################################################
    ###TFtdcFBTTransferDirectionType是一个银期转帐方向类型
    #########################################################################
    ctypedef char TThostFtdcFBTTransferDirectionType

    #########################################################################
    ###TFtdcOpenOrDestroyType是一个开销户类别类型
    #########################################################################
    ctypedef char TThostFtdcOpenOrDestroyType

    #########################################################################
    ###TFtdcAvailabilityFlagType是一个有效标志类型
    #########################################################################
    ctypedef char TThostFtdcAvailabilityFlagType

    #########################################################################
    ###TFtdcOrganTypeType是一个机构类型类型
    #########################################################################
    ctypedef char TThostFtdcOrganTypeType

    #########################################################################
    ###TFtdcOrganLevelType是一个机构级别类型
    #########################################################################
    ctypedef char TThostFtdcOrganLevelType

    #########################################################################
    ###TFtdcProtocalIDType是一个协议类型类型
    #########################################################################
    ctypedef char TThostFtdcProtocalIDType

    #########################################################################
    ###TFtdcConnectModeType是一个套接字连接方式类型
    #########################################################################
    ctypedef char TThostFtdcConnectModeType

    #########################################################################
    ###TFtdcSyncModeType是一个套接字通信方式类型
    #########################################################################
    ctypedef char TThostFtdcSyncModeType

    #########################################################################
    ###TFtdcBankAccTypeType是一个银行帐号类型类型
    #########################################################################
    ctypedef char TThostFtdcBankAccTypeType

    #########################################################################
    ###TFtdcFutureAccTypeType是一个期货公司帐号类型类型
    #########################################################################
    ctypedef char TThostFtdcFutureAccTypeType

    #########################################################################
    ###TFtdcOrganStatusType是一个接入机构状态类型
    #########################################################################
    ctypedef char TThostFtdcOrganStatusType

    #########################################################################
    ###TFtdcCCBFeeModeType是一个建行收费模式类型
    #########################################################################
    ctypedef char TThostFtdcCCBFeeModeType

    #########################################################################
    ###TFtdcCommApiTypeType是一个通讯API类型类型
    #########################################################################
    ctypedef char TThostFtdcCommApiTypeType

    #########################################################################
    ###TFtdcServiceIDType是一个服务编号类型
    #########################################################################
    ctypedef int TThostFtdcServiceIDType

    #########################################################################
    ###TFtdcServiceLineNoType是一个服务线路编号类型
    #########################################################################
    ctypedef int TThostFtdcServiceLineNoType

    #########################################################################
    ###TFtdcServiceNameType是一个服务名类型
    #########################################################################
    ctypedef char TThostFtdcServiceNameType[61]

    #########################################################################
    ###TFtdcLinkStatusType是一个连接状态类型
    #########################################################################
    ctypedef char TThostFtdcLinkStatusType

    #########################################################################
    ###TFtdcCommApiPointerType是一个通讯API指针类型
    #########################################################################
    ctypedef int TThostFtdcCommApiPointerType

    #########################################################################
    ###TFtdcPwdFlagType是一个密码核对标志类型
    #########################################################################
    ctypedef char TThostFtdcPwdFlagType

    #########################################################################
    ###TFtdcSecuAccTypeType是一个期货帐号类型类型
    #########################################################################
    ctypedef char TThostFtdcSecuAccTypeType

    #########################################################################
    ###TFtdcTransferStatusType是一个转账交易状态类型
    #########################################################################
    ctypedef char TThostFtdcTransferStatusType

    #########################################################################
    ###TFtdcSponsorTypeType是一个发起方类型
    #########################################################################
    ctypedef char TThostFtdcSponsorTypeType

    #########################################################################
    ###TFtdcReqRspTypeType是一个请求响应类别类型
    #########################################################################
    ctypedef char TThostFtdcReqRspTypeType

    #########################################################################
    ###TFtdcFBTUserEventTypeType是一个银期转帐用户事件类型类型
    #########################################################################
    ctypedef char TThostFtdcFBTUserEventTypeType

    #########################################################################
    ###TFtdcBankIDByBankType是一个银行自己的编码类型
    #########################################################################
    ctypedef char TThostFtdcBankIDByBankType[21]

    #########################################################################
    ###TFtdcBankOperNoType是一个银行操作员号类型
    #########################################################################
    ctypedef char TThostFtdcBankOperNoType[4]

    #########################################################################
    ###TFtdcBankCustNoType是一个银行客户号类型
    #########################################################################
    ctypedef char TThostFtdcBankCustNoType[21]

    #########################################################################
    ###TFtdcDBOPSeqNoType是一个递增的序列号类型
    #########################################################################
    ctypedef int TThostFtdcDBOPSeqNoType

    #########################################################################
    ###TFtdcTableNameType是一个FBT表名类型
    #########################################################################
    ctypedef char TThostFtdcTableNameType[61]

    #########################################################################
    ###TFtdcPKNameType是一个FBT表操作主键名类型
    #########################################################################
    ctypedef char TThostFtdcPKNameType[201]

    #########################################################################
    ###TFtdcPKValueType是一个FBT表操作主键值类型
    #########################################################################
    ctypedef char TThostFtdcPKValueType[501]

    #########################################################################
    ###TFtdcDBOperationType是一个记录操作类型类型
    #########################################################################
    ctypedef char TThostFtdcDBOperationType

    #########################################################################
    ###TFtdcSyncFlagType是一个同步标记类型
    #########################################################################
    ctypedef char TThostFtdcSyncFlagType

    #########################################################################
    ###TFtdcTargetIDType是一个同步目标编号类型
    #########################################################################
    ctypedef char TThostFtdcTargetIDType[4]

    #########################################################################
    ###TFtdcSyncTypeType是一个同步类型类型
    #########################################################################
    ctypedef char TThostFtdcSyncTypeType

    #########################################################################
    ###TFtdcFBETimeType是一个各种换汇时间类型
    #########################################################################
    ctypedef char TThostFtdcFBETimeType[7]

    #########################################################################
    ###TFtdcFBEBankNoType是一个换汇银行行号类型
    #########################################################################
    ctypedef char TThostFtdcFBEBankNoType[13]

    #########################################################################
    ###TFtdcFBECertNoType是一个换汇凭证号类型
    #########################################################################
    ctypedef char TThostFtdcFBECertNoType[13]

    #########################################################################
    ###TFtdcExDirectionType是一个换汇方向类型
    #########################################################################
    ctypedef char TThostFtdcExDirectionType

    #########################################################################
    ###TFtdcFBEBankAccountType是一个换汇银行账户类型
    #########################################################################
    ctypedef char TThostFtdcFBEBankAccountType[33]

    #########################################################################
    ###TFtdcFBEBankAccountNameType是一个换汇银行账户名类型
    #########################################################################
    ctypedef char TThostFtdcFBEBankAccountNameType[61]

    #########################################################################
    ###TFtdcFBEAmtType是一个各种换汇金额类型
    #########################################################################
    ctypedef double TThostFtdcFBEAmtType

    #########################################################################
    ###TFtdcFBEBusinessTypeType是一个换汇业务类型类型
    #########################################################################
    ctypedef char TThostFtdcFBEBusinessTypeType[3]

    #########################################################################
    ###TFtdcFBEPostScriptType是一个换汇附言类型
    #########################################################################
    ctypedef char TThostFtdcFBEPostScriptType[61]

    #########################################################################
    ###TFtdcFBERemarkType是一个换汇备注类型
    #########################################################################
    ctypedef char TThostFtdcFBERemarkType[71]

    #########################################################################
    ###TFtdcExRateType是一个换汇汇率类型
    #########################################################################
    ctypedef double TThostFtdcExRateType

    #########################################################################
    ###TFtdcFBEResultFlagType是一个换汇成功标志类型
    #########################################################################
    ctypedef char TThostFtdcFBEResultFlagType

    #########################################################################
    ###TFtdcFBERtnMsgType是一个换汇返回信息类型
    #########################################################################
    ctypedef char TThostFtdcFBERtnMsgType[61]

    #########################################################################
    ###TFtdcFBEExtendMsgType是一个换汇扩展信息类型
    #########################################################################
    ctypedef char TThostFtdcFBEExtendMsgType[61]

    #########################################################################
    ###TFtdcFBEBusinessSerialType是一个换汇记账流水号类型
    #########################################################################
    ctypedef char TThostFtdcFBEBusinessSerialType[31]

    #########################################################################
    ###TFtdcFBESystemSerialType是一个换汇流水号类型
    #########################################################################
    ctypedef char TThostFtdcFBESystemSerialType[21]

    #########################################################################
    ###TFtdcFBETotalExCntType是一个换汇交易总笔数类型
    #########################################################################
    ctypedef int TThostFtdcFBETotalExCntType

    #########################################################################
    ###TFtdcFBEExchStatusType是一个换汇交易状态类型
    #########################################################################
    ctypedef char TThostFtdcFBEExchStatusType

    #########################################################################
    ###TFtdcFBEFileFlagType是一个换汇文件标志类型
    #########################################################################
    ctypedef char TThostFtdcFBEFileFlagType

    #########################################################################
    ###TFtdcFBEAlreadyTradeType是一个换汇已交易标志类型
    #########################################################################
    ctypedef char TThostFtdcFBEAlreadyTradeType

    #########################################################################
    ###TFtdcFBEOpenBankType是一个换汇账户开户行类型
    #########################################################################
    ctypedef char TThostFtdcFBEOpenBankType[61]

    #########################################################################
    ###TFtdcFBEUserEventTypeType是一个银期换汇用户事件类型类型
    #########################################################################
    ctypedef char TThostFtdcFBEUserEventTypeType

    #########################################################################
    ###TFtdcFBEFileNameType是一个换汇相关文件名类型
    #########################################################################
    ctypedef char TThostFtdcFBEFileNameType[21]

    #########################################################################
    ###TFtdcFBEBatchSerialType是一个换汇批次号类型
    #########################################################################
    ctypedef char TThostFtdcFBEBatchSerialType[21]

    #########################################################################
    ###TFtdcFBEReqFlagType是一个换汇发送标志类型
    #########################################################################
    ctypedef char TThostFtdcFBEReqFlagType

    #########################################################################
    ###TFtdcNotifyClassType是一个风险通知类型类型
    #########################################################################
    ctypedef char TThostFtdcNotifyClassType

    #########################################################################
    ###TFtdcRiskNofityInfoType是一个客户风险通知消息类型
    #########################################################################
    ctypedef char TThostFtdcRiskNofityInfoType[257]

    #########################################################################
    ###TFtdcForceCloseSceneIdType是一个强平场景编号类型
    #########################################################################
    ctypedef char TThostFtdcForceCloseSceneIdType[24]

    #########################################################################
    ###TFtdcForceCloseTypeType是一个强平单类型类型
    #########################################################################
    ctypedef char TThostFtdcForceCloseTypeType

    #########################################################################
    ###TFtdcInstrumentIDsType是一个多个产品代码,用+分隔,如cu+zn类型
    #########################################################################
    ctypedef char TThostFtdcInstrumentIDsType[101]

    #########################################################################
    ###TFtdcRiskNotifyMethodType是一个风险通知途径类型
    #########################################################################
    ctypedef char TThostFtdcRiskNotifyMethodType

    #########################################################################
    ###TFtdcRiskNotifyStatusType是一个风险通知状态类型
    #########################################################################
    ctypedef char TThostFtdcRiskNotifyStatusType

    #########################################################################
    ###TFtdcRiskUserEventType是一个风控用户操作事件类型
    #########################################################################
    ctypedef char TThostFtdcRiskUserEventType

    #########################################################################
    ###TFtdcParamIDType是一个参数代码类型
    #########################################################################
    ctypedef int TThostFtdcParamIDType

    #########################################################################
    ###TFtdcParamNameType是一个参数名类型
    #########################################################################
    ctypedef char TThostFtdcParamNameType[41]

    #########################################################################
    ###TFtdcParamValueType是一个参数值类型
    #########################################################################
    ctypedef char TThostFtdcParamValueType[41]

    #########################################################################
    ###TFtdcConditionalOrderSortTypeType是一个条件单索引条件类型
    #########################################################################
    ctypedef char TThostFtdcConditionalOrderSortTypeType

    #########################################################################
    ###TFtdcSendTypeType是一个报送状态类型
    #########################################################################
    ctypedef char TThostFtdcSendTypeType

    #########################################################################
    ###TFtdcClientIDStatusType是一个交易编码状态类型
    #########################################################################
    ctypedef char TThostFtdcClientIDStatusType

    #########################################################################
    ###TFtdcIndustryIDType是一个行业编码类型
    #########################################################################
    ctypedef char TThostFtdcIndustryIDType[17]

    #########################################################################
    ###TFtdcQuestionIDType是一个特有信息编号类型
    #########################################################################
    ctypedef char TThostFtdcQuestionIDType[5]

    #########################################################################
    ###TFtdcQuestionContentType是一个特有信息说明类型
    #########################################################################
    ctypedef char TThostFtdcQuestionContentType[41]

    #########################################################################
    ###TFtdcOptionIDType是一个选项编号类型
    #########################################################################
    ctypedef char TThostFtdcOptionIDType[13]

    #########################################################################
    ###TFtdcOptionContentType是一个选项说明类型
    #########################################################################
    ctypedef char TThostFtdcOptionContentType[61]

    #########################################################################
    ###TFtdcQuestionTypeType是一个特有信息类型类型
    #########################################################################
    ctypedef char TThostFtdcQuestionTypeType

    #########################################################################
    ###TFtdcProcessIDType是一个业务流水号类型
    #########################################################################
    ctypedef char TThostFtdcProcessIDType[33]

    #########################################################################
    ###TFtdcSeqNoType是一个流水号类型
    #########################################################################
    ctypedef int TThostFtdcSeqNoType

    #########################################################################
    ###TFtdcUOAProcessStatusType是一个流程状态类型
    #########################################################################
    ctypedef char TThostFtdcUOAProcessStatusType[3]

    #########################################################################
    ###TFtdcProcessTypeType是一个流程功能类型类型
    #########################################################################
    ctypedef char TThostFtdcProcessTypeType[3]

    #########################################################################
    ###TFtdcBusinessTypeType是一个业务类型类型
    #########################################################################
    ctypedef char TThostFtdcBusinessTypeType

    #########################################################################
    ###TFtdcCfmmcReturnCodeType是一个监控中心返回码类型
    #########################################################################
    ctypedef char TThostFtdcCfmmcReturnCodeType

    #########################################################################
    ###TFtdcExReturnCodeType是一个交易所返回码类型
    #########################################################################
    ctypedef int TThostFtdcExReturnCodeType

    #########################################################################
    ###TFtdcClientTypeType是一个客户类型类型
    #########################################################################
    ctypedef char TThostFtdcClientTypeType

    #########################################################################
    ###TFtdcExchangeIDTypeType是一个交易所编号类型
    #########################################################################
    ctypedef char TThostFtdcExchangeIDTypeType

    #########################################################################
    ###TFtdcExClientIDTypeType是一个交易编码类型类型
    #########################################################################
    ctypedef char TThostFtdcExClientIDTypeType

    #########################################################################
    ###TFtdcClientClassifyType是一个客户分类码类型
    #########################################################################
    ctypedef char TThostFtdcClientClassifyType[11]

    #########################################################################
    ###TFtdcUOAOrganTypeType是一个单位性质类型
    #########################################################################
    ctypedef char TThostFtdcUOAOrganTypeType[11]

    #########################################################################
    ###TFtdcUOACountryCodeType是一个国家代码类型
    #########################################################################
    ctypedef char TThostFtdcUOACountryCodeType[11]

    #########################################################################
    ###TFtdcAreaCodeType是一个区号类型
    #########################################################################
    ctypedef char TThostFtdcAreaCodeType[11]

    #########################################################################
    ###TFtdcFuturesIDType是一个监控中心为客户分配的代码类型
    #########################################################################
    ctypedef char TThostFtdcFuturesIDType[21]

    #########################################################################
    ###TFtdcCffmcDateType是一个日期类型
    #########################################################################
    ctypedef char TThostFtdcCffmcDateType[11]

    #########################################################################
    ###TFtdcCffmcTimeType是一个时间类型
    #########################################################################
    ctypedef char TThostFtdcCffmcTimeType[11]

    #########################################################################
    ###TFtdcNocIDType是一个组织机构代码类型
    #########################################################################
    ctypedef char TThostFtdcNocIDType[21]

    #########################################################################
    ###TFtdcUpdateFlagType是一个更新状态类型
    #########################################################################
    ctypedef char TThostFtdcUpdateFlagType

    #########################################################################
    ###TFtdcApplyOperateIDType是一个申请动作类型
    #########################################################################
    ctypedef char TThostFtdcApplyOperateIDType

    #########################################################################
    ###TFtdcApplyStatusIDType是一个申请状态类型
    #########################################################################
    ctypedef char TThostFtdcApplyStatusIDType

    #########################################################################
    ###TFtdcSendMethodType是一个发送方式类型
    #########################################################################
    ctypedef char TThostFtdcSendMethodType

    #########################################################################
    ###TFtdcEventTypeType是一个业务操作类型类型
    #########################################################################
    ctypedef char TThostFtdcEventTypeType[33]

    #########################################################################
    ###TFtdcEventModeType是一个操作方法类型
    #########################################################################
    ctypedef char TThostFtdcEventModeType

    #########################################################################
    ###TFtdcUOAAutoSendType是一个统一开户申请自动发送类型
    #########################################################################
    ctypedef char TThostFtdcUOAAutoSendType

    #########################################################################
    ###TFtdcQueryDepthType是一个查询深度类型
    #########################################################################
    ctypedef int TThostFtdcQueryDepthType

    #########################################################################
    ###TFtdcDataCenterIDType是一个数据中心代码类型
    #########################################################################
    ctypedef int TThostFtdcDataCenterIDType

    #########################################################################
    ###TFtdcFlowIDType是一个流程ID类型
    #########################################################################
    ctypedef char TThostFtdcFlowIDType

    #########################################################################
    ###TFtdcCheckLevelType是一个复核级别类型
    #########################################################################
    ctypedef char TThostFtdcCheckLevelType

    #########################################################################
    ###TFtdcCheckNoType是一个操作次数类型
    #########################################################################
    ctypedef int TThostFtdcCheckNoType

    #########################################################################
    ###TFtdcCheckStatusType是一个复核级别类型
    #########################################################################
    ctypedef char TThostFtdcCheckStatusType

    #########################################################################
    ###TFtdcUsedStatusType是一个生效状态类型
    #########################################################################
    ctypedef char TThostFtdcUsedStatusType

    #########################################################################
    ###TFtdcRateTemplateNameType是一个模型名称类型
    #########################################################################
    ctypedef char TThostFtdcRateTemplateNameType[61]

    #########################################################################
    ###TFtdcPropertyStringType是一个用于查询的投资属性字段类型
    #########################################################################
    ctypedef char TThostFtdcPropertyStringType[2049]

    #########################################################################
    ###TFtdcBankAcountOriginType是一个账户来源类型
    #########################################################################
    ctypedef char TThostFtdcBankAcountOriginType

    #########################################################################
    ###TFtdcMonthBillTradeSumType是一个结算单月报成交汇总方式类型
    #########################################################################
    ctypedef char TThostFtdcMonthBillTradeSumType

    #########################################################################
    ###TFtdcFBTTradeCodeEnumType是一个银期交易代码枚举类型
    #########################################################################
    ctypedef char TThostFtdcFBTTradeCodeEnumType

    #########################################################################
    ###TFtdcRateTemplateIDType是一个模型代码类型
    #########################################################################
    ctypedef char TThostFtdcRateTemplateIDType[9]

    #########################################################################
    ###TFtdcRiskRateType是一个风险度类型
    #########################################################################
    ctypedef char TThostFtdcRiskRateType[21]

    #########################################################################
    ###TFtdcTimestampType是一个时间戳类型
    #########################################################################
    ctypedef int TThostFtdcTimestampType

    #########################################################################
    ###TFtdcInvestorIDRuleNameType是一个号段规则名称类型
    #########################################################################
    ctypedef char TThostFtdcInvestorIDRuleNameType[61]

    #########################################################################
    ###TFtdcInvestorIDRuleExprType是一个号段规则表达式类型
    #########################################################################
    ctypedef char TThostFtdcInvestorIDRuleExprType[513]

    #########################################################################
    ###TFtdcLastDriftType是一个上次OTP漂移值类型
    #########################################################################
    ctypedef int TThostFtdcLastDriftType

    #########################################################################
    ###TFtdcLastSuccessType是一个上次OTP成功值类型
    #########################################################################
    ctypedef int TThostFtdcLastSuccessType

    #########################################################################
    ###TFtdcAuthKeyType是一个令牌密钥类型
    #########################################################################
    ctypedef char TThostFtdcAuthKeyType[41]

    #########################################################################
    ###TFtdcSerialNumberType是一个序列号类型
    #########################################################################
    ctypedef char TThostFtdcSerialNumberType[17]

    #########################################################################
    ###TFtdcOTPTypeType是一个动态令牌类型类型
    #########################################################################
    ctypedef char TThostFtdcOTPTypeType

    #########################################################################
    ###TFtdcOTPVendorsIDType是一个动态令牌提供商类型
    #########################################################################
    ctypedef char TThostFtdcOTPVendorsIDType[2]

    #########################################################################
    ###TFtdcOTPVendorsNameType是一个动态令牌提供商名称类型
    #########################################################################
    ctypedef char TThostFtdcOTPVendorsNameType[61]

    #########################################################################
    ###TFtdcOTPStatusType是一个动态令牌状态类型
    #########################################################################
    ctypedef char TThostFtdcOTPStatusType

    #########################################################################
    ###TFtdcBrokerUserTypeType是一个经济公司用户类型类型
    #########################################################################
    ctypedef char TThostFtdcBrokerUserTypeType

    #########################################################################
    ###TFtdcFutureTypeType是一个期货类型类型
    #########################################################################
    ctypedef char TThostFtdcFutureTypeType

    #########################################################################
    ###TFtdcFundEventTypeType是一个资金管理操作类型类型
    #########################################################################
    ctypedef char TThostFtdcFundEventTypeType

    #########################################################################
    ###TFtdcAccountSourceTypeType是一个资金账户来源类型
    #########################################################################
    ctypedef char TThostFtdcAccountSourceTypeType

    #########################################################################
    ###TFtdcCodeSourceTypeType是一个交易编码来源类型
    #########################################################################
    ctypedef char TThostFtdcCodeSourceTypeType

    #########################################################################
    ###TFtdcUserRangeType是一个操作员范围类型
    #########################################################################
    ctypedef char TThostFtdcUserRangeType

    #########################################################################
    ###TFtdcTimeSpanType是一个时间跨度类型
    #########################################################################
    ctypedef char TThostFtdcTimeSpanType[9]

    #########################################################################
    ###TFtdcImportSequenceIDType是一个动态令牌导入批次编号类型
    #########################################################################
    ctypedef char TThostFtdcImportSequenceIDType[17]

    #########################################################################
    ###TFtdcByGroupType是一个交易统计表按客户统计方式类型
    #########################################################################
    ctypedef char TThostFtdcByGroupType

    #########################################################################
    ###TFtdcTradeSumStatModeType是一个交易统计表按范围统计方式类型
    #########################################################################
    ctypedef char TThostFtdcTradeSumStatModeType

    #########################################################################
    ###TFtdcComTypeType是一个组合成交类型类型
    #########################################################################
    ctypedef int TThostFtdcComTypeType

    #########################################################################
    ###TFtdcUserProductIDType是一个产品标识类型
    #########################################################################
    ctypedef char TThostFtdcUserProductIDType[33]

    #########################################################################
    ###TFtdcUserProductNameType是一个产品名称类型
    #########################################################################
    ctypedef char TThostFtdcUserProductNameType[65]

    #########################################################################
    ###TFtdcUserProductMemoType是一个产品说明类型
    #########################################################################
    ctypedef char TThostFtdcUserProductMemoType[129]

    #########################################################################
    ###TFtdcCSRCCancelFlagType是一个新增或变更标志类型
    #########################################################################
    ctypedef char TThostFtdcCSRCCancelFlagType[2]

    #########################################################################
    ###TFtdcCSRCDateType是一个日期类型
    #########################################################################
    ctypedef char TThostFtdcCSRCDateType[11]

    #########################################################################
    ###TFtdcCSRCInvestorNameType是一个客户名称类型
    #########################################################################
    ctypedef char TThostFtdcCSRCInvestorNameType[201]

    #########################################################################
    ###TFtdcCSRCOpenInvestorNameType是一个客户名称类型
    #########################################################################
    ctypedef char TThostFtdcCSRCOpenInvestorNameType[101]

    #########################################################################
    ###TFtdcCSRCInvestorIDType是一个客户代码类型
    #########################################################################
    ctypedef char TThostFtdcCSRCInvestorIDType[13]

    #########################################################################
    ###TFtdcCSRCIdentifiedCardNoType是一个证件号码类型
    #########################################################################
    ctypedef char TThostFtdcCSRCIdentifiedCardNoType[51]

    #########################################################################
    ###TFtdcCSRCClientIDType是一个交易编码类型
    #########################################################################
    ctypedef char TThostFtdcCSRCClientIDType[11]

    #########################################################################
    ###TFtdcCSRCBankFlagType是一个银行标识类型
    #########################################################################
    ctypedef char TThostFtdcCSRCBankFlagType[3]

    #########################################################################
    ###TFtdcCSRCBankAccountType是一个银行账户类型
    #########################################################################
    ctypedef char TThostFtdcCSRCBankAccountType[23]

    #########################################################################
    ###TFtdcCSRCOpenNameType是一个开户人类型
    #########################################################################
    ctypedef char TThostFtdcCSRCOpenNameType[401]

    #########################################################################
    ###TFtdcCSRCMemoType是一个说明类型
    #########################################################################
    ctypedef char TThostFtdcCSRCMemoType[101]

    #########################################################################
    ###TFtdcCSRCTimeType是一个时间类型
    #########################################################################
    ctypedef char TThostFtdcCSRCTimeType[11]

    #########################################################################
    ###TFtdcCSRCTradeIDType是一个成交流水号类型
    #########################################################################
    ctypedef char TThostFtdcCSRCTradeIDType[21]

    #########################################################################
    ###TFtdcCSRCExchangeInstIDType是一个合约代码类型
    #########################################################################
    ctypedef char TThostFtdcCSRCExchangeInstIDType[31]

    #########################################################################
    ###TFtdcCSRCMortgageNameType是一个质押品名称类型
    #########################################################################
    ctypedef char TThostFtdcCSRCMortgageNameType[7]

    #########################################################################
    ###TFtdcCSRCReasonType是一个事由类型
    #########################################################################
    ctypedef char TThostFtdcCSRCReasonType[3]

    #########################################################################
    ###TFtdcIsSettlementType是一个是否为非结算会员类型
    #########################################################################
    ctypedef char TThostFtdcIsSettlementType[2]

    #########################################################################
    ###TFtdcCSRCMoneyType是一个资金类型
    #########################################################################
    ctypedef double TThostFtdcCSRCMoneyType

    #########################################################################
    ###TFtdcCSRCPriceType是一个价格类型
    #########################################################################
    ctypedef double TThostFtdcCSRCPriceType

    #########################################################################
    ###TFtdcCSRCOptionsTypeType是一个期权类型类型
    #########################################################################
    ctypedef char TThostFtdcCSRCOptionsTypeType[2]

    #########################################################################
    ###TFtdcCSRCStrikePriceType是一个执行价类型
    #########################################################################
    ctypedef double TThostFtdcCSRCStrikePriceType

    #########################################################################
    ###TFtdcCSRCTargetProductIDType是一个标的品种类型
    #########################################################################
    ctypedef char TThostFtdcCSRCTargetProductIDType[3]

    #########################################################################
    ###TFtdcCSRCTargetInstrIDType是一个标的合约类型
    #########################################################################
    ctypedef char TThostFtdcCSRCTargetInstrIDType[31]

    #########################################################################
    ###TFtdcCommModelNameType是一个手续费率模板名称类型
    #########################################################################
    ctypedef char TThostFtdcCommModelNameType[161]

    #########################################################################
    ###TFtdcCommModelMemoType是一个手续费率模板备注类型
    #########################################################################
    ctypedef char TThostFtdcCommModelMemoType[1025]

    #########################################################################
    ###TFtdcExprSetModeType是一个日期表达式设置类型类型
    #########################################################################
    ctypedef char TThostFtdcExprSetModeType

    #########################################################################
    ###TFtdcRateInvestorRangeType是一个投资者范围类型
    #########################################################################
    ctypedef char TThostFtdcRateInvestorRangeType

    #########################################################################
    ###TFtdcAgentBrokerIDType是一个代理经纪公司代码类型
    #########################################################################
    ctypedef char TThostFtdcAgentBrokerIDType[13]

    #########################################################################
    ###TFtdcDRIdentityIDType是一个交易中心代码类型
    #########################################################################
    ctypedef int TThostFtdcDRIdentityIDType

    #########################################################################
    ###TFtdcDRIdentityNameType是一个交易中心名称类型
    #########################################################################
    ctypedef char TThostFtdcDRIdentityNameType[65]

    #########################################################################
    ###TFtdcDBLinkIDType是一个DBLink标识号类型
    #########################################################################
    ctypedef char TThostFtdcDBLinkIDType[31]

    #########################################################################
    ###TFtdcSyncDataStatusType是一个主次用系统数据同步状态类型
    #########################################################################
    ctypedef char TThostFtdcSyncDataStatusType

    #########################################################################
    ###TFtdcTradeSourceType是一个成交来源类型
    #########################################################################
    ctypedef char TThostFtdcTradeSourceType

    #########################################################################
    ###TFtdcFlexStatModeType是一个产品合约统计方式类型
    #########################################################################
    ctypedef char TThostFtdcFlexStatModeType

    #########################################################################
    ###TFtdcByInvestorRangeType是一个投资者范围统计方式类型
    #########################################################################
    ctypedef char TThostFtdcByInvestorRangeType

    #########################################################################
    ###TFtdcSRiskRateType是一个风险度类型
    #########################################################################
    ctypedef char TThostFtdcSRiskRateType[21]

    #########################################################################
    ###TFtdcSequenceNo12Type是一个序号类型
    #########################################################################
    ctypedef int TThostFtdcSequenceNo12Type

    #########################################################################
    ###TFtdcPropertyInvestorRangeType是一个投资者范围类型
    #########################################################################
    ctypedef char TThostFtdcPropertyInvestorRangeType

    #########################################################################
    ###TFtdcFileStatusType是一个文件状态类型
    #########################################################################
    ctypedef char TThostFtdcFileStatusType

    #########################################################################
    ###TFtdcFileGenStyleType是一个文件生成方式类型
    #########################################################################
    ctypedef char TThostFtdcFileGenStyleType

    #########################################################################
    ###TFtdcSysOperModeType是一个系统日志操作方法类型
    #########################################################################
    ctypedef char TThostFtdcSysOperModeType

    #########################################################################
    ###TFtdcSysOperTypeType是一个系统日志操作类型类型
    #########################################################################
    ctypedef char TThostFtdcSysOperTypeType

    #########################################################################
    ###TFtdcCSRCDataQueyTypeType是一个上报数据查询类型类型
    #########################################################################
    ctypedef char TThostFtdcCSRCDataQueyTypeType

    #########################################################################
    ###TFtdcFreezeStatusType是一个休眠状态类型
    #########################################################################
    ctypedef char TThostFtdcFreezeStatusType

    #########################################################################
    ###TFtdcStandardStatusType是一个规范状态类型
    #########################################################################
    ctypedef char TThostFtdcStandardStatusType

    #########################################################################
    ###TFtdcCSRCFreezeStatusType是一个休眠状态类型
    #########################################################################
    ctypedef char TThostFtdcCSRCFreezeStatusType[2]

    #########################################################################
    ###TFtdcRightParamTypeType是一个配置类型类型
    #########################################################################
    ctypedef char TThostFtdcRightParamTypeType

    #########################################################################
    ###TFtdcRightTemplateIDType是一个模板代码类型
    #########################################################################
    ctypedef char TThostFtdcRightTemplateIDType[9]

    #########################################################################
    ###TFtdcRightTemplateNameType是一个模板名称类型
    #########################################################################
    ctypedef char TThostFtdcRightTemplateNameType[61]

    #########################################################################
    ###TFtdcDataStatusType是一个反洗钱审核表数据状态类型
    #########################################################################
    ctypedef char TThostFtdcDataStatusType

    #########################################################################
    ###TFtdcAMLCheckStatusType是一个审核状态类型
    #########################################################################
    ctypedef char TThostFtdcAMLCheckStatusType

    #########################################################################
    ###TFtdcAmlDateTypeType是一个日期类型类型
    #########################################################################
    ctypedef char TThostFtdcAmlDateTypeType

    #########################################################################
    ###TFtdcAmlCheckLevelType是一个审核级别类型
    #########################################################################
    ctypedef char TThostFtdcAmlCheckLevelType

    #########################################################################
    ###TFtdcAmlCheckFlowType是一个反洗钱数据抽取审核流程类型
    #########################################################################
    ctypedef char TThostFtdcAmlCheckFlowType[2]

    #########################################################################
    ###TFtdcDataTypeType是一个数据类型类型
    #########################################################################
    ctypedef char TThostFtdcDataTypeType[129]

    #########################################################################
    ###TFtdcExportFileTypeType是一个导出文件类型类型
    #########################################################################
    ctypedef char TThostFtdcExportFileTypeType

    #########################################################################
    ###TFtdcSettleManagerTypeType是一个结算配置类型类型
    #########################################################################
    ctypedef char TThostFtdcSettleManagerTypeType

    #########################################################################
    ###TFtdcSettleManagerIDType是一个结算配置代码类型
    #########################################################################
    ctypedef char TThostFtdcSettleManagerIDType[33]

    #########################################################################
    ###TFtdcSettleManagerNameType是一个结算配置名称类型
    #########################################################################
    ctypedef char TThostFtdcSettleManagerNameType[129]

    #########################################################################
    ###TFtdcSettleManagerLevelType是一个结算配置等级类型
    #########################################################################
    ctypedef char TThostFtdcSettleManagerLevelType

    #########################################################################
    ###TFtdcSettleManagerGroupType是一个模块分组类型
    #########################################################################
    ctypedef char TThostFtdcSettleManagerGroupType

    #########################################################################
    ###TFtdcCheckResultMemoType是一个核对结果说明类型
    #########################################################################
    ctypedef char TThostFtdcCheckResultMemoType[1025]

    #########################################################################
    ###TFtdcFunctionUrlType是一个功能链接类型
    #########################################################################
    ctypedef char TThostFtdcFunctionUrlType[1025]

    #########################################################################
    ###TFtdcAuthInfoType是一个客户端认证信息类型
    #########################################################################
    ctypedef char TThostFtdcAuthInfoType[129]

    #########################################################################
    ###TFtdcAuthCodeType是一个客户端认证码类型
    #########################################################################
    ctypedef char TThostFtdcAuthCodeType[17]

    #########################################################################
    ###TFtdcLimitUseTypeType是一个保值额度使用类型类型
    #########################################################################
    ctypedef char TThostFtdcLimitUseTypeType

    #########################################################################
    ###TFtdcDataResourceType是一个数据来源类型
    #########################################################################
    ctypedef char TThostFtdcDataResourceType

    #########################################################################
    ###TFtdcMarginTypeType是一个保证金类型类型
    #########################################################################
    ctypedef char TThostFtdcMarginTypeType

    #########################################################################
    ###TFtdcActiveTypeType是一个生效类型类型
    #########################################################################
    ctypedef char TThostFtdcActiveTypeType

    #########################################################################
    ###TFtdcMarginRateTypeType是一个冲突保证金率类型类型
    #########################################################################
    ctypedef char TThostFtdcMarginRateTypeType

    #########################################################################
    ###TFtdcBackUpStatusType是一个备份数据状态类型
    #########################################################################
    ctypedef char TThostFtdcBackUpStatusType

    #########################################################################
    ###TFtdcInitSettlementType是一个结算初始化状态类型
    #########################################################################
    ctypedef char TThostFtdcInitSettlementType

    #########################################################################
    ###TFtdcReportStatusType是一个报表数据生成状态类型
    #########################################################################
    ctypedef char TThostFtdcReportStatusType

    #########################################################################
    ###TFtdcSaveStatusType是一个数据归档状态类型
    #########################################################################
    ctypedef char TThostFtdcSaveStatusType

    #########################################################################
    ###TFtdcSettArchiveStatusType是一个结算确认数据归档状态类型
    #########################################################################
    ctypedef char TThostFtdcSettArchiveStatusType

    #########################################################################
    ###TFtdcCTPTypeType是一个CTP交易系统类型类型
    #########################################################################
    ctypedef char TThostFtdcCTPTypeType

    #########################################################################
    ###TFtdcToolIDType是一个工具代码类型
    #########################################################################
    ctypedef char TThostFtdcToolIDType[9]

    #########################################################################
    ###TFtdcToolNameType是一个工具名称类型
    #########################################################################
    ctypedef char TThostFtdcToolNameType[81]

    #########################################################################
    ###TFtdcCloseDealTypeType是一个平仓处理类型类型
    #########################################################################
    ctypedef char TThostFtdcCloseDealTypeType

    #########################################################################
    ###TFtdcMortgageFundUseRangeType是一个货币质押资金可用范围类型
    #########################################################################
    ctypedef char TThostFtdcMortgageFundUseRangeType

    #########################################################################
    ###TFtdcCurrencyUnitType是一个币种单位数量类型
    #########################################################################
    ctypedef double TThostFtdcCurrencyUnitType

    #########################################################################
    ###TFtdcExchangeRateType是一个汇率类型
    #########################################################################
    ctypedef double TThostFtdcExchangeRateType

    #########################################################################
    ###TFtdcSpecProductTypeType是一个特殊产品类型类型
    #########################################################################
    ctypedef char TThostFtdcSpecProductTypeType

    #########################################################################
    ###TFtdcFundMortgageTypeType是一个货币质押类型类型
    #########################################################################
    ctypedef char TThostFtdcFundMortgageTypeType

    #########################################################################
    ###TFtdcAccountSettlementParamIDType是一个投资者账户结算参数代码类型
    #########################################################################
    ctypedef char TThostFtdcAccountSettlementParamIDType

    #########################################################################
    ###TFtdcCurrencyNameType是一个币种名称类型
    #########################################################################
    ctypedef char TThostFtdcCurrencyNameType[31]

    #########################################################################
    ###TFtdcCurrencySignType是一个币种符号类型
    #########################################################################
    ctypedef char TThostFtdcCurrencySignType[4]

    #########################################################################
    ###TFtdcFundMortDirectionType是一个货币质押方向类型
    #########################################################################
    ctypedef char TThostFtdcFundMortDirectionType

    #########################################################################
    ###TFtdcBusinessClassType是一个换汇类别类型
    #########################################################################
    ctypedef char TThostFtdcBusinessClassType

    #########################################################################
    ###TFtdcSwapSourceTypeType是一个换汇数据来源类型
    #########################################################################
    ctypedef char TThostFtdcSwapSourceTypeType

    #########################################################################
    ###TFtdcCurrExDirectionType是一个换汇类型类型
    #########################################################################
    ctypedef char TThostFtdcCurrExDirectionType

    #########################################################################
    ###TFtdcCurrencySwapStatusType是一个申请状态类型
    #########################################################################
    ctypedef char TThostFtdcCurrencySwapStatusType

    #########################################################################
    ###TFtdcCurrExchCertNoType是一个凭证号类型
    #########################################################################
    ctypedef char TThostFtdcCurrExchCertNoType[13]

    #########################################################################
    ###TFtdcBatchSerialNoType是一个批次号类型
    #########################################################################
    ctypedef char TThostFtdcBatchSerialNoType[21]

    #########################################################################
    ###TFtdcReqFlagType是一个换汇发送标志类型
    #########################################################################
    ctypedef char TThostFtdcReqFlagType

    #########################################################################
    ###TFtdcResFlagType是一个换汇返回成功标志类型
    #########################################################################
    ctypedef char TThostFtdcResFlagType

    #########################################################################
    ###TFtdcPageControlType是一个换汇页面控制类型
    #########################################################################
    ctypedef char TThostFtdcPageControlType[2]

    #########################################################################
    ###TFtdcRecordCountType是一个记录数类型
    #########################################################################
    ctypedef int TThostFtdcRecordCountType

    #########################################################################
    ###TFtdcCurrencySwapMemoType是一个换汇需确认信息类型
    #########################################################################
    ctypedef char TThostFtdcCurrencySwapMemoType[101]

    #########################################################################
    ###TFtdcExStatusType是一个修改状态类型
    #########################################################################
    ctypedef char TThostFtdcExStatusType

    #########################################################################
    ###TFtdcClientRegionType是一个开户客户地域类型
    #########################################################################
    ctypedef char TThostFtdcClientRegionType

    #########################################################################
    ###TFtdcWorkPlaceType是一个工作单位类型
    #########################################################################
    ctypedef char TThostFtdcWorkPlaceType[101]

    #########################################################################
    ###TFtdcBusinessPeriodType是一个经营期限类型
    #########################################################################
    ctypedef char TThostFtdcBusinessPeriodType[21]

    #########################################################################
    ###TFtdcWebSiteType是一个网址类型
    #########################################################################
    ctypedef char TThostFtdcWebSiteType[101]

    #########################################################################
    ###TFtdcUOAIdCardTypeType是一个统一开户证件类型类型
    #########################################################################
    ctypedef char TThostFtdcUOAIdCardTypeType[3]

    #########################################################################
    ###TFtdcClientModeType是一个开户模式类型
    #########################################################################
    ctypedef char TThostFtdcClientModeType[3]

    #########################################################################
    ###TFtdcInvestorFullNameType是一个投资者全称类型
    #########################################################################
    ctypedef char TThostFtdcInvestorFullNameType[101]

    #########################################################################
    ###TFtdcUOABrokerIDType是一个境外中介机构ID类型
    #########################################################################
    ctypedef char TThostFtdcUOABrokerIDType[11]

    #########################################################################
    ###TFtdcUOAZipCodeType是一个邮政编码类型
    #########################################################################
    ctypedef char TThostFtdcUOAZipCodeType[11]

    #########################################################################
    ###TFtdcUOAEMailType是一个电子邮箱类型
    #########################################################################
    ctypedef char TThostFtdcUOAEMailType[101]

    #########################################################################
    ###TFtdcOldCityType是一个城市类型
    #########################################################################
    ctypedef char TThostFtdcOldCityType[41]

    #########################################################################
    ###TFtdcCorporateIdentifiedCardNoType是一个法人代表证件号码类型
    #########################################################################
    ctypedef char TThostFtdcCorporateIdentifiedCardNoType[101]

    #########################################################################
    ###TFtdcHasBoardType是一个是否有董事会类型
    #########################################################################
    ctypedef char TThostFtdcHasBoardType

    #########################################################################
    ###TFtdcStartModeType是一个启动模式类型
    #########################################################################
    ctypedef char TThostFtdcStartModeType

    #########################################################################
    ###TFtdcTemplateTypeType是一个模型类型类型
    #########################################################################
    ctypedef char TThostFtdcTemplateTypeType

    #########################################################################
    ###TFtdcLoginModeType是一个登录模式类型
    #########################################################################
    ctypedef char TThostFtdcLoginModeType

    #########################################################################
    ###TFtdcPromptTypeType是一个日历提示类型类型
    #########################################################################
    ctypedef char TThostFtdcPromptTypeType

    #########################################################################
    ###TFtdcLedgerManageIDType是一个分户管理资产编码类型
    #########################################################################
    ctypedef char TThostFtdcLedgerManageIDType[51]

    #########################################################################
    ###TFtdcInvestVarietyType是一个投资品种类型
    #########################################################################
    ctypedef char TThostFtdcInvestVarietyType[101]

    #########################################################################
    ###TFtdcBankAccountTypeType是一个账户类别类型
    #########################################################################
    ctypedef char TThostFtdcBankAccountTypeType[2]

    #########################################################################
    ###TFtdcLedgerManageBankType是一个开户银行类型
    #########################################################################
    ctypedef char TThostFtdcLedgerManageBankType[101]

    #########################################################################
    ###TFtdcCffexDepartmentNameType是一个开户营业部类型
    #########################################################################
    ctypedef char TThostFtdcCffexDepartmentNameType[101]

    #########################################################################
    ###TFtdcCffexDepartmentCodeType是一个营业部代码类型
    #########################################################################
    ctypedef char TThostFtdcCffexDepartmentCodeType[9]

    #########################################################################
    ###TFtdcHasTrusteeType是一个是否有托管人类型
    #########################################################################
    ctypedef char TThostFtdcHasTrusteeType

    #########################################################################
    ###TFtdcCSRCMemo1Type是一个说明类型
    #########################################################################
    ctypedef char TThostFtdcCSRCMemo1Type[41]

    #########################################################################
    ###TFtdcAssetmgrCFullNameType是一个代理资产管理业务的期货公司全称类型
    #########################################################################
    ctypedef char TThostFtdcAssetmgrCFullNameType[101]

    #########################################################################
    ###TFtdcAssetmgrApprovalNOType是一个资产管理业务批文号类型
    #########################################################################
    ctypedef char TThostFtdcAssetmgrApprovalNOType[51]

    #########################################################################
    ###TFtdcAssetmgrMgrNameType是一个资产管理业务负责人姓名类型
    #########################################################################
    ctypedef char TThostFtdcAssetmgrMgrNameType[401]

    #########################################################################
    ###TFtdcAmTypeType是一个机构类型类型
    #########################################################################
    ctypedef char TThostFtdcAmTypeType

    #########################################################################
    ###TFtdcCSRCAmTypeType是一个机构类型类型
    #########################################################################
    ctypedef char TThostFtdcCSRCAmTypeType[5]

    #########################################################################
    ###TFtdcCSRCFundIOTypeType是一个出入金类型类型
    #########################################################################
    ctypedef char TThostFtdcCSRCFundIOTypeType

    #########################################################################
    ###TFtdcCusAccountTypeType是一个结算账户类型类型
    #########################################################################
    ctypedef char TThostFtdcCusAccountTypeType

    #########################################################################
    ###TFtdcCSRCNationalType是一个国籍类型
    #########################################################################
    ctypedef char TThostFtdcCSRCNationalType[4]

    #########################################################################
    ###TFtdcCSRCSecAgentIDType是一个二级代理ID类型
    #########################################################################
    ctypedef char TThostFtdcCSRCSecAgentIDType[11]

    #########################################################################
    ###TFtdcLanguageTypeType是一个通知语言类型类型
    #########################################################################
    ctypedef char TThostFtdcLanguageTypeType

    #########################################################################
    ###TFtdcAmAccountType是一个投资账户类型
    #########################################################################
    ctypedef char TThostFtdcAmAccountType[23]

    #########################################################################
    ###TFtdcAssetmgrClientTypeType是一个资产管理客户类型类型
    #########################################################################
    ctypedef char TThostFtdcAssetmgrClientTypeType

    #########################################################################
    ###TFtdcAssetmgrTypeType是一个投资类型类型
    #########################################################################
    ctypedef char TThostFtdcAssetmgrTypeType

    #########################################################################
    ###TFtdcUOMType是一个计量单位类型
    #########################################################################
    ctypedef char TThostFtdcUOMType[11]

    #########################################################################
    ###TFtdcSHFEInstLifePhaseType是一个上期所合约生命周期状态类型
    #########################################################################
    ctypedef char TThostFtdcSHFEInstLifePhaseType[3]

    #########################################################################
    ###TFtdcSHFEProductClassType是一个产品类型类型
    #########################################################################
    ctypedef char TThostFtdcSHFEProductClassType[11]

    #########################################################################
    ###TFtdcPriceDecimalType是一个价格小数位类型
    #########################################################################
    ctypedef char TThostFtdcPriceDecimalType[2]

    #########################################################################
    ###TFtdcInTheMoneyFlagType是一个平值期权标志类型
    #########################################################################
    ctypedef char TThostFtdcInTheMoneyFlagType[2]

    #########################################################################
    ###TFtdcCheckInstrTypeType是一个合约比较类型类型
    #########################################################################
    ctypedef char TThostFtdcCheckInstrTypeType

    #########################################################################
    ###TFtdcDeliveryTypeType是一个交割类型类型
    #########################################################################
    ctypedef char TThostFtdcDeliveryTypeType

    #########################################################################
    ###TFtdcBigMoneyType是一个资金类型
    #########################################################################
    ctypedef double TThostFtdcBigMoneyType

    #########################################################################
    ###TFtdcMaxMarginSideAlgorithmType是一个大额单边保证金算法类型
    #########################################################################
    ctypedef char TThostFtdcMaxMarginSideAlgorithmType

    #########################################################################
    ###TFtdcDAClientTypeType是一个资产管理客户类型类型
    #########################################################################
    ctypedef char TThostFtdcDAClientTypeType

    #########################################################################
    ###TFtdcCombinInstrIDType是一个套利合约代码类型
    #########################################################################
    ctypedef char TThostFtdcCombinInstrIDType[61]

    #########################################################################
    ###TFtdcCombinSettlePriceType是一个各腿结算价类型
    #########################################################################
    ctypedef char TThostFtdcCombinSettlePriceType[61]

    #########################################################################
    ###TFtdcDCEPriorityType是一个优先级类型
    #########################################################################
    ctypedef int TThostFtdcDCEPriorityType

    #########################################################################
    ###TFtdcTradeGroupIDType是一个成交组号类型
    #########################################################################
    ctypedef int TThostFtdcTradeGroupIDType

    #########################################################################
    ###TFtdcIsCheckPrepaType是一个是否校验开户可用资金类型
    #########################################################################
    ctypedef int TThostFtdcIsCheckPrepaType

    #########################################################################
    ###TFtdcUOAAssetmgrTypeType是一个投资类型类型
    #########################################################################
    ctypedef char TThostFtdcUOAAssetmgrTypeType

    #########################################################################
    ###TFtdcDirectionEnType是一个买卖方向类型
    #########################################################################
    ctypedef char TThostFtdcDirectionEnType

    #########################################################################
    ###TFtdcOffsetFlagEnType是一个开平标志类型
    #########################################################################
    ctypedef char TThostFtdcOffsetFlagEnType

    #########################################################################
    ###TFtdcHedgeFlagEnType是一个投机套保标志类型
    #########################################################################
    ctypedef char TThostFtdcHedgeFlagEnType

    #########################################################################
    ###TFtdcFundIOTypeEnType是一个出入金类型类型
    #########################################################################
    ctypedef char TThostFtdcFundIOTypeEnType

    #########################################################################
    ###TFtdcFundTypeEnType是一个资金类型类型
    #########################################################################
    ctypedef char TThostFtdcFundTypeEnType

    #########################################################################
    ###TFtdcFundDirectionEnType是一个出入金方向类型
    #########################################################################
    ctypedef char TThostFtdcFundDirectionEnType

    #########################################################################
    ###TFtdcFundMortDirectionEnType是一个货币质押方向类型
    #########################################################################
    ctypedef char TThostFtdcFundMortDirectionEnType

    #########################################################################
    ###TFtdcSwapBusinessTypeType是一个换汇业务种类类型
    #########################################################################
    ctypedef char TThostFtdcSwapBusinessTypeType[3]

    #########################################################################
    ###TFtdcOptionsTypeType是一个期权类型类型
    #########################################################################
    ctypedef char TThostFtdcOptionsTypeType

    #########################################################################
    ###TFtdcStrikeModeType是一个执行方式类型
    #########################################################################
    ctypedef char TThostFtdcStrikeModeType

    #########################################################################
    ###TFtdcStrikeTypeType是一个执行类型类型
    #########################################################################
    ctypedef char TThostFtdcStrikeTypeType

    #########################################################################
    ###TFtdcApplyTypeType是一个中金所期权放弃执行申请类型类型
    #########################################################################
    ctypedef char TThostFtdcApplyTypeType

    #########################################################################
    ###TFtdcGiveUpDataSourceType是一个放弃执行申请数据来源类型
    #########################################################################
    ctypedef char TThostFtdcGiveUpDataSourceType

    #########################################################################
    ###TFtdcExecOrderSysIDType是一个执行宣告系统编号类型
    #########################################################################
    ctypedef char TThostFtdcExecOrderSysIDType[21]

    #########################################################################
    ###TFtdcExecResultType是一个执行结果类型
    #########################################################################
    ctypedef char TThostFtdcExecResultType

    #########################################################################
    ###TFtdcStrikeSequenceType是一个执行序号类型
    #########################################################################
    ctypedef int TThostFtdcStrikeSequenceType

    #########################################################################
    ###TFtdcStrikeTimeType是一个执行时间类型
    #########################################################################
    ctypedef char TThostFtdcStrikeTimeType[13]

    #########################################################################
    ###TFtdcCombinationTypeType是一个组合类型类型
    #########################################################################
    ctypedef char TThostFtdcCombinationTypeType

    #########################################################################
    ###TFtdcOptionRoyaltyPriceTypeType是一个期权权利金价格类型类型
    #########################################################################
    ctypedef char TThostFtdcOptionRoyaltyPriceTypeType

    #########################################################################
    ###TFtdcBalanceAlgorithmType是一个权益算法类型
    #########################################################################
    ctypedef char TThostFtdcBalanceAlgorithmType

    #########################################################################
    ###TFtdcActionTypeType是一个执行类型类型
    #########################################################################
    ctypedef char TThostFtdcActionTypeType

    #########################################################################
    ###TFtdcForQuoteStatusType是一个询价状态类型
    #########################################################################
    ctypedef char TThostFtdcForQuoteStatusType

    #########################################################################
    ###TFtdcValueMethodType是一个取值方式类型
    #########################################################################
    ctypedef char TThostFtdcValueMethodType

    #########################################################################
    ###TFtdcExecOrderPositionFlagType是一个期权行权后是否保留期货头寸的标记类型
    #########################################################################
    ctypedef char TThostFtdcExecOrderPositionFlagType

    #########################################################################
    ###TFtdcExecOrderCloseFlagType是一个期权行权后生成的头寸是否自动平仓类型
    #########################################################################
    ctypedef char TThostFtdcExecOrderCloseFlagType

    #########################################################################
    ###TFtdcProductTypeType是一个产品类型类型
    #########################################################################
    ctypedef char TThostFtdcProductTypeType

    #########################################################################
    ###TFtdcCZCEUploadFileNameType是一个郑商所结算文件名类型
    #########################################################################
    ctypedef char TThostFtdcCZCEUploadFileNameType

    #########################################################################
    ###TFtdcDCEUploadFileNameType是一个大商所结算文件名类型
    #########################################################################
    ctypedef char TThostFtdcDCEUploadFileNameType

    #########################################################################
    ###TFtdcSHFEUploadFileNameType是一个上期所结算文件名类型
    #########################################################################
    ctypedef char TThostFtdcSHFEUploadFileNameType

    #########################################################################
    ###TFtdcCFFEXUploadFileNameType是一个中金所结算文件名类型
    #########################################################################
    ctypedef char TThostFtdcCFFEXUploadFileNameType

    #########################################################################
    ###TFtdcCombDirectionType是一个组合指令方向类型
    #########################################################################
    ctypedef char TThostFtdcCombDirectionType
